{"version":"1.0","truncation":null,"padding":null,"added_tokens":[{"id":0,"special":true,"content":"[UNK]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":1,"special":true,"content":"[CLS]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":2,"special":true,"content":"[SEP]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":3,"special":true,"content":"[PAD]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":4,"special":true,"content":"[MASK]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false}],"normalizer":{"type":"Sequence","normalizers":[{"type":"NFD"},{"type":"Lowercase"},{"type":"StripAccents"}]},"pre_tokenizer":{"type":"Whitespace"},"post_processor":{"type":"TemplateProcessing","single":[{"SpecialToken":{"id":"[CLS]","type_id":0}},{"Sequence":{"id":"A","type_id":0}},{"SpecialToken":{"id":"[SEP]","type_id":0}}],"pair":[{"SpecialToken":{"id":"[CLS]","type_id":0}},{"Sequence":{"id":"A","type_id":0}},{"SpecialToken":{"id":"[SEP]","type_id":0}},{"Sequence":{"id":"B","type_id":1}},{"SpecialToken":{"id":"[SEP]","type_id":1}}],"special_tokens":{"[CLS]":{"id":"[CLS]","ids":[1],"tokens":["[CLS]"]},"[SEP]":{"id":"[SEP]","ids":[2],"tokens":["[SEP]"]}}},"decoder":null,"model":{"type":"WordPiece","unk_token":"[UNK]","continuing_subword_prefix":"##","max_input_chars_per_word":100,"vocab":{"[UNK]":0,"[CLS]":1,"[SEP]":2,"[PAD]":3,"[MASK]":4,"!":5,"\"":6,"#":7,"$":8,"%":9,"&":10,"'":11,"(":12,")":13,"*":14,"+":15,",":16,"-":17,".":18,"/":19,"0":20,"1":21,"2":22,"3":23,"4":24,"5":25,"6":26,"7":27,"8":28,"9":29,":":30,";":31,"<":32,"=":33,">":34,"?":35,"@":36,"[":37,"\\":38,"]":39,"^":40,"_":41,"`":42,"a":43,"b":44,"c":45,"d":46,"e":47,"f":48,"g":49,"h":50,"i":51,"j":52,"k":53,"l":54,"m":55,"n":56,"o":57,"p":58,"q":59,"r":60,"s":61,"t":62,"u":63,"v":64,"w":65,"x":66,"y":67,"z":68,"{":69,"|":70,"}":71,"~":72,"с":73,"—":74,"‘":75,"’":76,"“":77,"”":78,"…":79,"##f":80,"##l":81,"##a":82,"##g":83,"##s":84,"##_":85,"##n":86,"##m":87,"##e":88,"##p":89,"##c":90,"##r":91,"##t":92,"##i":93,"##z":94,"##u":95,"##1":96,"##0":97,"##d":98,"##o":99,"##y":100,"##h":101,"##w":102,"##x":103,"##6":104,"##“":105,"##b":106,"##q":107,"##.":108,"##+":109,"##,":110,"##v":111,"##k":112,"##)":113,"##2":114,"##9":115,"##4":116,"##7":117,"##8":118,"##5":119,"##j":120,"##3":121,"##[":122,"##`":123,"##>":124,"##/":125,"##(":126,"##\"":127,"##:":128,"##-":129,"##}":130,"##%":131,"##\\":132,"##…":133,"##=":134,"##'":135,"##<":136,"##*":137,"##{":138,"##&":139,"##]":140,"##?":141,"##@":142,"##’":143,"##!":144,"##;":145,"##$":146,"###":147,"##|":148,"##~":149,"##or":150,"##er":151,"##in":152,"##on":153,"##at":154,"##en":155,"##es":156,"in":157,"##ion":158,"##le":159,"##ing":160,"##ar":161,"for":162,"##an":163,"to":164,"##ed":165,"##dd":166,"##al":167,"##it":168,"##ch":169,"fi":170,"add":171,"re":172,"fix":173,"##st":174,"##ut":175,"##ro":176,"##ct":177,"##mp":178,"##ve":179,"##od":180,"##est":181,"##et":182,"th":183,"an":184,"##ac":185,"##ent":186,"##re":187,"##se":188,"##ad":189,"##il":190,"##un":191,"##ic":192,"##ens":193,"##orch":194,"op":195,"and":196,"test":197,"on":198,"##ort":199,"##ation":200,"##up":201,"##iz":202,"##ensor":203,"##pe":204,"##oc":205,"of":206,"##ate":207,"py":208,"co":209,"##ove":210,"##am":211,"con":212,"##ul":213,"##ment":214,"##port":215,"de":216,"##ab":217,"##lo":218,"##ri":219,"tensor":220,"##ud":221,"##ak":222,"##ss":223,"di":224,"st":225,"##ag":226,"##ction":227,"bu":228,"##ode":229,"torch":230,"the":231,"##ce":232,"##ant":233,"rem":234,"##ack":235,"##able":236,"ex":237,"##ap":238,"##ith":239,"##ol":240,"sup":241,"##ake":242,"up":243,"ch":244,"support":245,"##ig":246,"doc":247,"pyt":248,"cud":249,"##ff":250,"##ec":251,"remove":252,"ca":253,"##unction":254,"##uant":255,"with":256,"imp":257,"##ot":258,"al":259,"ty":260,"##ers":261,"at":262,"##rom":263,"en":264,"##ter":265,"##im":266,"un":267,"use":268,"function":269,"quant":270,"##ess":271,"##as":272,"cuda":273,"##ist":274,"##ur":275,"##ild":276,"from":277,"##el":278,"##rad":279,"::":280,"##all":281,"##po":282,"##pt":283,"##id":284,"upd":285,"##ator":286,"comp":287,"build":288,"lo":289,"##and":290,"##ex":291,"##us":292,"wh":293,"##ize":294,"##ang":295,"][":296,"##atch":297,"##orm":298,"##put":299,"##ffe":300,"##om":301,"pro":302,"##ver":303,"##eck":304,"##pl":305,"##nx":306,"##ore":307,"##ult":308,"onnx":309,"make":310,"tests":311,"##ctor":312,"##age":313,"caffe":314,"##rap":315,"update":316,"##ror":317,"##is":318,"##op":319,"##pu":320,"##ace":321,"##ard":322,"caffe2":323,"sc":324,"##nn":325,"##fa":326,"##erator":327,"##_t":328,"##em":329,"##ial":330,"tr":331,"er":332,"int":333,"jit":334,"##ind":335,"##ow":336,"pytorch":337,"()":338,"##ly":339,"##if":340,"sh":341,"##lement":342,"opt":343,"error":344,"ar":345,"##um":346,"when":347,"check":348,"cl":349,"##cl":350,"lin":351,"##end":352,"type":353,"##ub":354,"##par":355,"##low":356,"move":357,"##ue":358,"##ip":359,"par":360,"##pi":361,"mod":362,"aten":363,"is":364,"##_c":365,"##hon":366,"##ument":367,"operator":368,"##ass":369,"##ule":370,"enable":371,"##raph":372,"back":373,"out":374,"code":375,"nn":376,"##ib":377,"implement":378,"##grad":379,"##rib":380,"##ari":381,"python":382,"##ization":383,"##ty":384,"##ive":385,"##_d":386,"##ew":387,"conv":388,"##ribut":389,"##_s":390,"##ork":391,"##ax":392,"aut":393,"dis":394,"not":395,"##ast":396,"us":397,"##ning":398,"as":399,"##int":400,"##nel":401,"docs":402,"##ob":403,"##ay":404,"##ame":405,"##ript":406,"##ary":407,"##pr":408,"inst":409,"be":410,"arg":411,"##ru":412,"##ure":413,"gen":414,"ops":415,"##ersion":416,"chang":417,"log":418,"##ile":419,"graph":420,"##ath":421,"functions":422,"set":423,"##ward":424,"api":425,"input":426,"all":427,"##per":428,"##ir":429,"##mpl":430,"impro":431,"##ity":432,"dist":433,"run":434,"cpu":435,"##fer":436,"##ence":437,"##qu":438,"##10":439,"##out":440,"met":441,"pr":442,"##_f":443,"vari":444,"war":445,"const":446,"fx":447,"mode":448,"##vic":449,"##ead":450,"work":451,"bug":452,"##ine":453,"auto":454,"res":455,"##ions":456,"red":457,"##_m":458,"improve":459,"com":460,"##py":461,"se":462,"##ized":463,"##ain":464,"##_n":465,"dat":466,"##form":467,"more":468,"##yn":469,"grad":470,"gener":471,"##ated":472,"##pp":473,"##ernel":474,"##igh":475,"##fault":476,"##hod":477,"allow":478,"##factor":479,"added":480,"warning":481,"spe":482,"fl":483,"ind":484,"by":485,"mult":486,"non":487,"call":488,"c10":489,"po":490,"cont":491,"refactor":492,"module":493,"batch":494,"script":495,"##indow":496,"##ome":497,"##cess":498,"cm":499,"##les":500,"##pc":501,"##ime":502,"##ify":503,"##ans":504,"optim":505,"tensors":506,"hand":507,"##vice":508,"window":509,"##atic":510,"av":511,"##ight":512,"distribut":513,"some":514,"##_b":515,"##uce":516,"cle":517,"##ark":518,"windows":519,"do":520,"##ations":521,"version":522,"##eg":523,"##tr":524,"##ape":525,"##mb":526,"++":527,"new":528,"cmake":529,"autograd":530,"pre":531,"##und":532,"##ference":533,"method":534,"dep":535,"##arg":536,"default":537,"##parse":538,"mem":539,"nam":540,"if":541,"that":542,"##ert":543,"inter":544,"document":545,"##ench":546,"output":547,"##ring":548,"rel":549,"##th":550,"##rect":551,"argument":552,"##oid":553,"##ory":554,"fixes":555,"export":556,"so":557,"clean":558,"change":559,"get":560,"dim":561,"##iv":562,"##ign":563,"roc":564,"##mod":565,"##lex":566,"param":567,"min":568,"##16":569,"ac":570,"##bs":571,"kernel":572,"mess":573,"##mode":574,"reg":575,"##urn":576,"it":577,"##ug":578,"##place":579,"lib":580,"rpc":581,"##fo":582,"##ail":583,"sub":584,"##eter":585,"rocm":586,"init":587,"option":588,"device":589,"##loat":590,"##pool":591,"##alar":592,"##con":593,"##ative":594,"##mark":595,"##de":596,"pass":597,"##enc":598,"cpp":599,"##patch":600,"adding":601,"val":602,"##read":603,"##enchmark":604,"test_":605,"mi":606,"ci":607,"##used":608,"we":609,"##av":610,"into":611,"ret":612,"form":613,"over":614,"##os":615,"per":616,"##pes":617,"index":618,"##ase":619,"##type":620,"backward":621,"##pack":622,"size":623,"##der":624,"sparse":625,"typo":626,"##ules":627,"##ise":628,"model":629,"class":630,"##ok":631,"##val":632,"##expr":633,"##clud":634,"gpu":635,"##impl":636,"only":637,"iss":638,"list":639,"##ding":640,"##let":641,"shape":642,"##ep":643,"##kl":644,"static":645,"spec":646,"memory":647,"copy":648,"##ous":649,"distributed":650,"ren":651,"complex":652,"disable":653,"##amp":654,"num":655,"documentation":656,"##alle":657,"variable":658,"##ccl":659,"##orrect":660,"##roup":661,"quantized":662,"scalar":663,"sk":664,"##ft":665,"##ient":666,"##_l":667,"bo":668,"ass":669,"miss":670,"max":671,"instead":672,"benchmark":673,"ad":674,"format":675,"graphmode":676,"clang":677,"skip":678,"##ling":679,"##ite":680,"##cept":681,"##ov":682,"trans":683,"cre":684,"backend":685,"message":686,"missing":687,"return":688,"cu":689,"cudnn":690,"tensorexpr":691,"regist":692,"te":693,"lay":694,"##_in":695,"##pose":696,"le":697,"##fil":698,"##ments":699,"don":700,"fus":701,"##gen":702,"##ance":703,"operators":704,"using":705,"dispatch":706,"##max":707,"comm":708,"data":709,"implementation":710,"includ":711,"##ition":712,"##2d":713,"inference":714,"pack":715,"##ruct":716,"##ility":717,"avoid":718,"fb":719,"->":720,"##_test":721,"##lic":722,"##fin":723,"rec":724,"##ide":725,"##allel":726,"quantization":727,"##ues":728,"file":729,"##erial":730,"read":731,"bet":732,"sy":733,"##ll":734,"replace":735,"##obile":736,"port":737,"sp":738,"##ias":739,"fixed":740,"##ext":741,"or":742,"##ave":743,"##ution":744,"no":745,"##tensor":746,"ut":747,"reduce":748,"nccl":749,"norm":750,"##ump":751,"##ull":752,"##mpty":753,"handle":754,"##ach":755,"##time":756,"line":757,"inputs":758,"##ync":759,"rename":760,"correct":761,"##ifi":762,"bin":763,"##__":764,"##edding":765,"##check":766,"##ils":767,"compil":768,"names":769,"glo":770,"##add":771,"##ting":772,"types":773,"functional":774,"##norm":775,"process":776,"##plit":777,"name":778,"##ype":779,"load":780,"##ample":781,"gradient":782,"lint":783,"##info":784,"initial":785,"##_w":786,"##not":787,"print":788,"bro":789,"unused":790,"emb":791,"##_op":792,"##ffer":793,"link":794,"modules":795,"##_g":796,"##ect":797,"##quant":798,"empty":799,"##ream":800,"pl":801,"##wise":802,"##ong":803,"files":804,"mkl":805,"path":806,"##ix":807,"minor":808,"##izer":809,"fp":810,"rand":811,"##ge":812,"##ke":813,"nnc":814,"mobile":815,"ab":816,"##rec":817,"##lect":818,"float":819,"generic":820,"weight":821,"##_p":822,"##ero":823,"embedding":824,"im":825,"##lete":826,"##back":827,"thc":828,"warnings":829,"native":830,"##rate":831,"att":832,"profil":833,"mac":834,"requ":835,"bl":836,"##_st":837,"##cast":838,"##tern":839,"constru":840,"rnn":841,"serial":842,"##fig":843,"##ook":844,"##ask":845,"##urce":846,"assert":847,"##cript":848,"##bug":849,"logic":850,"issue":851,"##line":852,"thread":853,"##ock":854,"##plic":855,"split":856,"##pace":857,"depend":858,"##_r":859,"##co":860,"##dp":861,"##ages":862,"flag":863,"##loss":864,"##uda":865,"net":866,"annot":867,"##module":868,"##_h":869,"##ension":870,"##load":871,"##rid":872,"ddp":873,"ke":874,"methods":875,"##iter":876,"string":877,"mig":878,"##chem":879,"##ref":880,"install":881,"time":882,"##_tensor":883,"include":884,"bas":885,"sm":886,"layer":887,"##ere":888,"##olution":889,"##ather":890,"linear":891,"##ker":892,"##orage":893,"case":894,"checks":895,"multip":896,"cir":897,"fail":898,"##cle":899,"##ress":900,"##ally":901,"runtime":902,"ap":903,"##me":904,"fut":905,"ne":906,"obs":907,"##iew":908,"conver":909,"##cc":910,"cond":911,"delete":912,"exp":913,"##ging":914,"integ":915,"fp16":916,"el":917,"##ping":918,"pool":919,"builds":920,"ext":921,"docker":922,"##umpy":923,"##igu":924,"trac":925,"changes":926,"binary":927,"##list":928,"##mm":929,"import":930,"cleanup":931,"##ency":932,"det":933,"##uc":934,"##mbol":935,"##annel":936,"##adcast":937,"debug":938,"struct":939,"migrate":940,"are":941,"head":942,"##ynam":943,"##ci":944,"obser":945,"##eng":946,"ins":947,"##uard":948,"##ynamic":949,"##ill":950,"remov":951,"##que":952,"numb":953,"symbol":954,"##ampl":955,"##atib":956,"##rod":957,"unit":958,"##ange":959,"wrap":960,"##ables":961,"create":962,"##ies":963,"testing":964,"loop":965,"handling":966,"deprec":967,"##stom":968,"broadcast":969,"constructor":970,"proper":971,"optimize":972,"match":973,"##ma":974,"std":975,"unn":976,"optional":977,"circle":978,"sw":979,"##ecess":980,"parameter":981,"##string":982,"arguments":983,"simpl":984,"##code":985,"##own":986,"value":987,"ag":988,"better":989,"##chema":990,"##iguous":991,"prot":992,"pri":993,"zero":994,"##ration":995,"##row":996,"##ply":997,"constant":998,"numpy":999,"##ord":1000,"reland":1001,"##ecessary":1002,"##fore":1003,"##ulk":1004,"package":1005,"##ating":1006,"##aster":1007,"##ftmax":1008,"inc":1009,"explic":1010,"##obs":1011,"fol":1012,"compar":1013,"setup":1014,"explicit":1015,"##min":1016,"##acy":1017,"circleci":1018,"take":1019,"##fter":1020,"##ates":1021,"cons":1022,"##ures":1023,"##ision":1024,"fusion":1025,"##fix":1026,"##ual":1027,"opinfo":1028,"##ocal":1029,"custom":1030,"attribut":1031,"group":1032,"ir":1033,"##alf":1034,"register":1035,"readme":1036,"dynamic":1037,"##ject":1038,"##atial":1039,"parallel":1040,"codegen":1041,"##tra":1042,"kernels":1043,"##ulkan":1044,"##_par":1045,"##oth":1046,"##ific":1047,"##eters":1048,"##_cuda":1049,"##opt":1050,"##roid":1051,"expose":1052,"##ash":1053,"##flow":1054,"doub":1055,"bind":1056,"can":1057,"la":1058,"ve":1059,"##ron":1060,"##unt":1061,"##uld":1062,"##pipe":1063,"multi":1064,"transform":1065,"serialization":1066,"after":1067,"##we":1068,"before":1069,"named":1070,"node":1071,"##lu":1072,"##_grad":1073,"##inter":1074,"spatial":1075,"##face":1076,"forward":1077,"errors":1078,"multiple":1079,"shar":1080,"dtype":1081,"compatib":1082,"vector":1083,"storage":1084,"vulkan":1085,"##ound":1086,"##value":1087,"state":1088,"except":1089,"unnecessary":1090,"man":1091,"##ike":1092,"tensorpipe":1093,"exec":1094,"conversion":1095,"utils":1096,"gloo":1097,"##uple":1098,"##lob":1099,"alias":1100,"##ptr":1101,"part":1102,"##_con":1103,"key":1104,"##pro":1105,"##vent":1106,"##alo":1107,"##ader":1108,"based":1109,"mer":1110,"##float":1111,"##ram":1112,"oper":1113,"order":1114,"mat":1115,"##sure":1116,"##torch":1117,"##ould":1118,"##aky":1119,"##_de":1120,"acc":1121,"fa":1122,"sign":1123,"wr":1124,"##rary":1125,"##test":1126,"##imp":1127,"##api":1128,"docstring":1129,"##sh":1130,"##_v":1131,"##uction":1132,"##ured":1133,"##verage":1134,"##aining":1135,"##riter":1136,"double":1137,"leg":1138,"##ost":1139,"fixing":1140,"channel":1141,"comput":1142,"alloc":1143,"##ength":1144,"act":1145,"##apt":1146,"##emm":1147,"introd":1148,"small":1149,"convert":1150,"hook":1151,"##ses":1152,"##ez":1153,"##ict":1154,"ref":1155,"logging":1156,"values":1157,"random":1158,"number":1159,"##aloader":1160,"have":1161,"##bo":1162,"android":1163,"calls":1164,"##conv":1165,"about":1166,"legacy":1167,"hard":1168,"##64":1169,"##error":1170,"##urr":1171,"parameters":1172,"##bind":1173,"extra":1174,"uns":1175,"used":1176,"##qual":1177,"ms":1178,"sum":1179,"tri":1180,"##stm":1181,"off":1182,"speed":1183,"source":1184,"submodule":1185,"indexing":1186,"##fferent":1187,"ios":1188,"##ld":1189,"##_pool":1190,"##kernel":1191,"##ensions":1192,"should":1193,"c10d":1194,"future":1195,"need":1196,"half":1197,"##ray":1198,"##one":1199,"##pect":1200,"col":1201,"macro":1202,"symbolic":1203,"simplify":1204,"##group":1205,"##_re":1206,"##ric":1207,"reference":1208,"config":1209,"fbcode":1210,"fe":1211,"##ical":1212,"one":1213,"des":1214,"sync":1215,"schema":1216,"##file":1217,"##set":1218,"##use":1219,"##32":1220,"##edi":1221,"##izes":1222,"defin":1223,"stream":1224,"##elper":1225,"##ra":1226,"##_co":1227,"##format":1228,"place":1229,"core":1230,"md":1231,"##script":1232,"##istent":1233,"dataloader":1234,"compilation":1235,"binding":1236,"mask":1237,"##net":1238,"##ire":1239,"##ature":1240,"ensure":1241,"interface":1242,"image":1243,"profiler":1244,"dependency":1245,"##_check":1246,"compile":1247,"math":1248,"##so":1249,"##og":1250,"open":1251,"div":1252,"contiguous":1253,"structured":1254,"##urrent":1255,"local":1256,"##cat":1257,"##itch":1258,"different":1259,"##obu":1260,"optimizer":1261,"perform":1262,"bfloat":1263,"sing":1264,"##odes":1265,"cases":1266,"normal":1267,"switch":1268,"--":1269,"env":1270,"##_function":1271,"variables":1272,"fake":1273,"ns":1274,"##ata":1275,"info":1276,"##igm":1277,"cast":1278,"##allback":1279,"point":1280,"dimension":1281,"bool":1282,"merge":1283,"c2":1284,"cat":1285,"pow":1286,"##3d":1287,"##aly":1288,"decl":1289,"dict":1290,"##arget":1291,"insert":1292,"##igmoid":1293,"ra":1294,"##preter":1295,"special":1296,"dro":1297,"ig":1298,"lstm":1299,"mis":1300,"##mul":1301,"##att":1302,"##alg":1303,"##ross":1304,"##olve":1305,"##nnpack":1306,"reduction":1307,"##_norm":1308,"rest":1309,"view":1310,"##1d":1311,"report":1312,"##unch":1313,"##ices":1314,"without":1315,"batchnorm":1316,"##ression":1317,"bit":1318,"element":1319,"map":1320,"##dnn":1321,"##arch":1322,"adds":1323,"##uplic":1324,"bump":1325,"checking":1326,"##riterion":1327,"guard":1328,"mov":1329,"##rc":1330,"inplace":1331,"dead":1332,"example":1333,"loss":1334,"separ":1335,"##_back":1336,"##ified":1337,"annotations":1338,"observer":1339,"##ins":1340,"context":1341,"requir":1342,"bfloat16":1343,"declar":1344,"me":1345,"##for":1346,"##_ex":1347,"##mit":1348,"stri":1349,"codemod":1350,"works":1351,"relu":1352,"issues":1353,"processgroup":1354,"pooling":1355,"gith":1356,"master":1357,"##utor":1358,"store":1359,"comment":1360,"fuser":1361,"##ternal":1362,"separate":1363,"github":1364,"hip":1365,"bound":1366,"tool":1367,"step":1368,"##pout":1369,"usage":1370,"comments":1371,"bre":1372,"##graph":1373,"##old":1374,"##astic":1375,"overload":1376,"header":1377,"10":1378,"qu":1379,"##ree":1380,"calling":1381,"softmax":1382,"temp":1383,"tracing":1384,"ign":1385,"full":1386,"long":1387,"nv":1388,"now":1389,"target":1390,"##met":1391,"where":1392,"##_tr":1393,"mkldnn":1394,"##af":1395,"##_ptr":1396,"##ense":1397,"##iterator":1398,"##idy":1399,"options":1400,"linalg":1401,"flaky":1402,"backwards":1403,"cc":1404,"##red":1405,"##wrap":1406,"##utils":1407,"torchscript":1408,"cach":1409,"##ote":1410,"##pos":1411,"##_type":1412,"trace":1413,"interpreter":1414,"##ugh":1415,"##adding":1416,"11":1417,"ed":1418,"find":1419,"gcc":1420,"##anc":1421,"##ick":1422,"##ish":1423,"block":1424,"expand":1425,"rref":1426,"##gemm":1427,"int8":1428,"duplic":1429,"ob":1430,"sort":1431,"save":1432,"##way":1433,"top":1434,"##vel":1435,"than":1436,"thnn":1437,"##uring":1438,"##_to":1439,"##aries":1440,"sequ":1441,"generate":1442,"does":1443,"outputs":1444,"common":1445,"profiling":1446,"iter":1447,"##wn":1448,"##aml":1449,"##ctory":1450,"##ible":1451,"##comp":1452,"introduce":1453,"sizes":1454,"##anh":1455,"pres":1456,"variant":1457,"scripts":1458,"accept":1459,"libtorch":1460,"explicitly":1461,"gather":1462,"has":1463,"any":1464,"tensoriterator":1465,"convolution":1466,"##ther":1467,"compatibility":1468,"activ":1469,"performance":1470,"single":1471,"cut":1472,"##ich":1473,"##stream":1474,"prov":1475,"autom":1476,"resize":1477,"improvements":1478,"nodes":1479,"tidy":1480,"##ler":1481,"##..":1482,"stop":1483,"which":1484,"note":1485,"##argin":1486,"templ":1487,"timeout":1488,"prim":1489,"pin":1490,"turn":1491,"##function":1492,"##gd":1493,"messages":1494,"exception":1495,"object":1496,"fast":1497,"kill":1498,"neg":1499,"yaml":1500,"##_out":1501,"##ux":1502,"##with":1503,"ups":1504,"low":1505,"##ison":1506,"intern":1507,"access":1508,"adapt":1509,"record":1510,"glob":1511,"conda":1512,"launch":1513,"##uff":1514,"##hape":1515,"##vc":1516,"def":1517,"prop":1518,"true":1519,"bias":1520,"blob":1521,"length":1522,"##jit":1523,"##atter":1524,"##odule":1525,"unify":1526,"updates":1527,"specific":1528,"##itional":1529,"namespace":1530,"comparison":1531,"cutorch":1532,"automatic":1533,"##ale":1534,"##ilt":1535,"##point":1536,"##ispatch":1537,"scatter":1538,"result":1539,"registration":1540,"apis":1541,"var":1542,"##fl":1543,"parity":1544,"args":1545,"level":1546,"properly":1547,"msvc":1548,"id":1549,"##criterion":1550,"##tc":1551,"##ique":1552,"direct":1553,"building":1554,"array":1555,"##_size":1556,"running":1557,"##ainer":1558,"none":1559,"dropout":1560,"during":1561,"##sis":1562,"##ource":1563,"##ha":1564,"##etric":1565,"analy":1566,"##ager":1567,"library":1568,"##etermin":1569,"classes":1570,"consistent":1571,"shared":1572,"app":1573,"fused":1574,"rst":1575,"spar":1576,"##sum":1577,"##ust":1578,"##ability":1579,"##alloc":1580,"clar":1581,"fbgemm":1582,"##ache":1583,"integer":1584,"##obuf":1585,"##_backward":1586,"tempor":1587,"slic":1588,"tw":1589,"tuple":1590,"##_se":1591,"##map":1592,"##to":1593,"##ention":1594,"dec":1595,"workflow":1596,"compiler":1597,"attribute":1598,"operations":1599,"mark":1600,"oss":1601,"ver":1602,"##attern":1603,"##unn":1604,"##ics":1605,"##param":1606,"##ariable":1607,"beh":1608,"##ightly":1609,"deprecated":1610,"again":1611,"protobuf":1612,"masked":1613,"##ways":1614,"##ection":1615,"##res":1616,"##rst":1617,"##dat":1618,"##vers":1619,"first":1620,"devic":1621,"always":1622,"updated":1623,"indices":1624,"flags":1625,"extend":1626,"##imple":1627,"adaptive":1628,"base":1629,"eas":1630,"same":1631,"##_un":1632,"##rough":1633,"##ential":1634,"quantize":1635,"try":1636,"seg":1637,"##_ops":1638,"jobs":1639,"mag":1640,"##ait":1641,"##alse":1642,"##rix":1643,"tensorimpl":1644,"##eld":1645,"##ops":1646,"clone":1647,"generated":1648,"optimization":1649,"prec":1650,"##avi":1651,"leak":1652,"##ween":1653,"##force":1654,"cal":1655,"dnn":1656,"equal":1657,"lite":1658,"old":1659,"other":1660,"##ms":1661,"##cul":1662,"##11":1663,"rele":1664,"throw":1665,"##agrad":1666,"typing":1667,"##opy":1668,"enabled":1669,"##types":1670,"##config":1671,"between":1672,"apply":1673,"incre":1674,"##_comp":1675,"bindings":1676,"propag":1677,"ivalue":1678,"syn":1679,"##aut":1680,"##gor":1681,"##dim":1682,"##ole":1683,"##base":1684,"pybind":1685,"built":1686,"eng":1687,"##istribut":1688,"compression":1689,"##omial":1690,"##undant":1691,"ignore":1692,"simple":1693,"##lin":1694,"##_as":1695,"##wr":1696,"##_torch":1697,"user":1698,"##ailable":1699,"behavi":1700,"3d":1701,"pt":1702,"range":1703,"##ped":1704,"##ia":1705,"##yle":1706,"##log":1707,"buffer":1708,"models":1709,"annotation":1710,"##options":1711,"collect":1712,"provide":1713,"internal":1714,"global":1715,"false":1716,"mut":1717,"own":1718,"padding":1719,"##las":1720,"##ml":1721,"##ograd":1722,"##ket":1723,"##ags":1724,"##apply":1725,"onnxifi":1726,"generator":1727,"##_for":1728,"flake":1729,"##args":1730,"##quantize":1731,"require":1732,"removing":1733,"mul":1734,"##art":1735,"stack":1736,"also":1737,"unique":1738,"##index":1739,"async":1740,"redundant":1741,"correctly":1742,"headers":1743,"broadcasting":1744,"agent":1745,"attributes":1746,"eig":1747,"hack":1748,"##uild":1749,"##ern":1750,"##rocess":1751,"thtensor":1752,"through":1753,"##ickl":1754,"##amma":1755,"style":1756,"##trans":1757,"perf":1758,"printing":1759,"##rides":1760,"failure":1761,"##ront":1762,"tools":1763,"break":1764,"preser":1765,"fallback":1766,"larg":1767,"pattern":1768,"vol":1769,"##_py":1770,"##bit":1771,"##view":1772,"##ily":1773,"##ctions":1774,"training":1775,"distribution":1776,"assign":1777,"detection":1778,"incorrect":1779,"##convolution":1780,"git":1781,"job":1782,"prom":1783,"##ps":1784,"##vm":1785,"inform":1786,"##aces":1787,"concat":1788,"prod":1789,"byt":1790,"its":1791,"subgraph":1792,"specify":1793,"transpose":1794,"##fined":1795,"##key":1796,"removed":1797,"my":1798,"nom":1799,"##_en":1800,"##_and":1801,"##work":1802,"dire":1803,"##igraph":1804,"intr":1805,"linux":1806,"bugfix":1807,"related":1808,"matrix":1809,"requires":1810,"engine":1811,"behavior":1812,"cr":1813,"current":1814,"hy":1815,"lu":1816,"os":1817,"qnnpack":1818,"##_all":1819,"##nigraph":1820,"##qr":1821,"##ken":1822,"##56":1823,"##inomial":1824,"##ats":1825,"inline":1826,"addmm":1827,"##unk":1828,"expect":1829,"##imin":1830,"##_mode":1831,"initialization":1832,"macos":1833,"deprecate":1834,"lower":1835,"cs":1836,"fbs":1837,"##atures":1838,"##ank":1839,"##aset":1840,"look":1841,"##_cpu":1842,"nnpack":1843,"select":1844,"##edictor":1845,"##atten":1846,"activation":1847,"##autograd":1848,"kw":1849,"pi":1850,"fil":1851,"fill":1852,"##_dict":1853,"reshape":1854,"avg":1855,"##cont":1856,"##_lib":1857,"elastic":1858,"wrapper":1859,"flake8":1860,"nan":1861,"row":1862,"##eriv":1863,"##urs":1864,"##lowp":1865,"uses":1866,"##press":1867,"##valid":1868,"##ampler":1869,"macros":1870,"declarations":1871,"mean":1872,"nomnigraph":1873,"nightly":1874,"##head":1875,"##state":1876,"conv2d":1877,"##ints":1878,"##_module":1879,"##avis":1880,"numer":1881,"elimin":1882,"##queez":1883,"negative":1884,"precision":1885,"cwrap":1886,"helper":1887,"mak":1888,"sigmoid":1889,"wip":1890,"##match":1891,"##ry":1892,"##are":1893,"##round":1894,"test_d":1895,"enforce":1896,"unde":1897,"##istic":1898,"##ell":1899,"bugs":1900,"##pooling":1901,"##encies":1902,"##_with":1903,"##box":1904,"needed":1905,"duplicate":1906,"##pers":1907,"inv":1908,"##ames":1909,"##apar":1910,"end":1911,"##usive":1912,"arc":1913,"##umul":1914,"pars":1915,"modify":1916,"##ences":1917,"typos":1918,"util":1919,"##obser":1920,"information":1921,"cor":1922,"fin":1923,"sure":1924,"##la":1925,"infer":1926,"##stem":1927,"##relu":1928,"exist":1929,"enh":1930,"prob":1931,"general":1932,"broken":1933,"condition":1934,"compute":1935,"allocator":1936,"edge":1937,"two":1938,"mypy":1939,"##aparallel":1940,"front":1941,"mpi":1942,"##pol":1943,"##around":1944,"field":1945,"##izing":1946,"##abel":1947,"stand":1948,"upgrad":1949,"clamp":1950,"##inear":1951,"reduc":1952,"available":1953,"prepar":1954,"prevent":1955,"##modules":1956,"valid":1957,"dispatcher":1958,"layernorm":1959,"upsample":1960,"go":1961,"ro":1962,"rather":1963,"sav":1964,"##_loss":1965,"##calar":1966,"##bag":1967,"##its":1968,"##ched":1969,"##upport":1970,"##ular":1971,"buc":1972,"##pth":1973,"travis":1974,"weights":1975,"##_pool2d":1976,"template":1977,"analysis":1978,"magma":1979,"preserve":1980,"undefined":1981,"determin":1982,"deriv":1983,"fc":1984,"few":1985,"last":1986,"sin":1987,"sel":1988,"tim":1989,"##xt":1990,"##ved":1991,"thd":1992,"##cell":1993,"unary":1994,"scale":1995,"##_dim":1996,"setting":1997,"workaround":1998,"poss":1999,"avx":2000,"##_init":2001,"laz":2002,"##_functions":2003,"##reduce":2004,"calcul":2005,"release":2006,"bc":2007,"cross":2008,"event":2009,"wait":2010,"##_kernel":2011,"##batch":2012,"##init":2013,"##ales":2014,"additional":2015,"repe":2016,"##unc":2017,"coverage":2018,"##vert":2019,"shard":2020,"##_c10":2021,"feature":2022,"raise":2023,"easy":2024,"fbsource":2025,"abs":2026,"null":2027,"rend":2028,"##vector":2029,"count":2030,"##_th":2031,"##_set":2032,"opset":2033,"black":2034,"##ampling":2035,"hards":2036,"devices":2037,"directory":2038,"hyp":2039,"##_e":2040,"##cp":2041,"external":2042,"##apes":2043,"##verse":2044,"##_met":2045,"##try":2046,"##ives":2047,"scalars":2048,"embeddingbag":2049,"keep":2050,"constructors":2051,"matching":2052,"executor":2053,"cache":2054,"doesn":2055,"directly":2056,"increase":2057,"##istributed":2058,"##write":2059,"large":2060,"upgrade":2061,"cub":2062,"eval":2063,"pub":2064,"##zero":2065,"reor":2066,"refer":2067,"##rol":2068,"str":2069,"supported":2070,"##iron":2071,"contribut":2072,"batched":2073,"distributions":2074,"interpol":2075,"thcunn":2076,"restore":2077,"workspace":2078,"pipe":2079,"around":2080,"both":2081,"dail":2082,"vec":2083,"##linter":2084,"##affe":2085,"##ier":2086,"##ute":2087,"##etype":2088,"##lobs":2089,"##agent":2090,"algor":2091,"multinomial":2092,"lists":2093,"formatting":2094,"##_input":2095,"loading":2096,"inside":2097,"##_parallel":2098,"moving":2099,"volum":2100,"##queeze":2101,"possible":2102,"daily":2103,"algorith":2104,"_c":2105,"ll":2106,"##_on":2107,"##_quant":2108,"##_utils":2109,"##db":2110,"impl":2111,"flatten":2112,"execution":2113,"spars":2114,"clarify":2115,"slice":2116,"frontend":2117,"pe":2118,"via":2119,"##ral":2120,"cos":2121,"##abling":2122,"remote":2123,"##omic":2124,"##_dispatch":2125,"relax":2126,"benchmarks":2127,"layout":2128,"##formatlinter":2129,"##affe2":2130,"volumetric":2131,"2d":2132,"br":2133,"hist":2134,"like":2135,"may":2136,"slow":2137,"tanh":2138,"##ng":2139,"##itions":2140,"whit":2141,"##very":2142,"##class":2143,"instru":2144,"prefix":2145,"includes":2146,"##linear":2147,"detect":2148,"compare":2149,"compatible":2150,"wrong":2151,"sequence":2152,"##allocator":2153,"crash":2154,"##usive_ptr":2155,"llvm":2156,"down":2157,"let":2158,"pol":2159,"tcp":2160,"vs":2161,"xla":2162,"##lock":2163,"##_o":2164,"##ef":2165,"##thon":2166,"##da":2167,"##esis":2168,"repr":2169,"##imit":2170,"under":2171,"generation":2172,"##alled":2173,"creation":2174,"recurs":2175,"basic":2176,"extensions":2177,"observers":2178,"folder":2179,"##_param":2180,"accumul":2181,"factor":2182,"hooks":2183,"##afe":2184,"csrc":2185,"self":2186,".*":2187,"dest":2188,"he":2189,"sample":2190,"txt":2191,"ub":2192,"zer":2193,"##guard":2194,"##be":2195,"##256":2196,"##channel":2197,"##eto":2198,"##amb":2199,"##omm":2200,"##clang":2201,"nnapi":2202,"construct":2203,"##avg":2204,"##clude":2205,"box":2206,"command":2207,"system":2208,"##_state":2209,"##optim":2210,"descript":2211,"environ":2212,"eliminate":2213,"hypoth":2214,"catch":2215,"dper":2216,"ide":2217,"qconfig":2218,"##variable":2219,"##ink":2220,"inlin":2221,"repl":2222,"##adata":2223,"##ism":2224,"arch":2225,"renam":2226,"##ifier":2227,"blas":2228,"dependencies":2229,"fold":2230,"stride":2231,"topk":2232,"##params":2233,"proble":2234,"hypothesis":2235,").":2236,"`,":2237,"fram":2238,"ht":2239,"race":2240,"##gamma":2241,"##name":2242,"##raries":2243,"##ky":2244,"inf":2245,"##leg":2246,"##lection":2247,"fork":2248,"##als":2249,"##chron":2250,"##izers":2251,"##ride":2252,"##oles":2253,"enum":2254,"##open":2255,"##emory":2256,"track":2257,"utility":2258,"##_work":2259,"integration":2260,"extension":2261,"signature":2262,"openmp":2263,"eigen":2264,"##transpose":2265,"prepare":2266,"_th":2267,"dtypes":2268,"hash":2269,"lat":2270,"most":2271,"put":2272,"rid":2273,"rule":2274,"##cache":2275,"##iff":2276,"invalid":2277,"##untime":2278,"##ensort":2279,"chunk":2280,"align":2281,"shad":2282,"shapes":2283,"##ework":2284,"##_sh":2285,"##peri":2286,"warn":2287,"worker":2288,"resub":2289,"versions":2290,"soft":2291,"dims":2292,"dimensions":2293,"##def":2294,"passes":2295,"##rided":2296,"##amples":2297,"define":2298,"##upported":2299,"faster":2300,"fuse":2301,"gru":2302,"high":2303,"##ful":2304,"##tri":2305,"##00":2306,"##div":2307,"##build":2308,"##ja":2309,"##ineto":2310,"##inja":2311,"##arily":2312,"##unic":2313,"##mental":2314,"##rig":2315,"##apack":2316,"##ush":2317,"##assert":2318,"predictor":2319,"##_max":2320,"gradcheck":2321,"params":2322,"test_jit":2323,"overflow":2324,"clangformat":2325,"##_gpu":2326,"images":2327,"construction":2328,"logical":2329,"##ification":2330,"matmul":2331,"mismatch":2332,"##ickler":2333,"intrusive_ptr":2334,"bucket":2335,"fbsourceclang":2336,"fbsourceclangformatlinter":2337,"average":2338,"but":2339,"blobs":2340,"dil":2341,"dump":2342,"fft":2343,"pad":2344,"pot":2345,"qat":2346,"##ls":2347,"##cuda":2348,"##her":2349,"##vd":2350,"##input":2351,"##arri":2352,"##arning":2353,"##store":2354,"##ested":2355,"thct":2356,"##lose":2357,"checkpoint":2358,"logs":2359,"section":2360,"batching":2361,"maxpool":2362,"adagrad":2363,"communic":2364,"##_group":2365,"##_device":2366,"write":2367,"extract":2368,"bounds":2369,"quick":2370,"##_output":2371,"decor":2372,"segfault":2373,"requires_grad":2374,"vec256":2375,"framework":2376,"##olesky":2377,"flo":2378,"send":2379,"tag":2380,"task":2381,"##fc":2382,"##_add":2383,"##_api":2384,"##ner":2385,"##nccl":2386,"##ually":2387,"##hold":2388,"##bn":2389,"##vous":2390,"##2gen":2391,"##ored":2392,"##enorm":2393,"rewrite":2394,"strides":2395,"##quence":2396,"resolve":2397,"contain":2398,"clear":2399,"##_inter":2400,"commit":2401,"paths":2402,"native_functions":2403,"futures":2404,"loops":2405,"##ogram":2406,"differenti":2407,"propagate":2408,"##rocessing":2409,"lookup":2410,"ideep":2411,"due":2412,"mm":2413,"round":2414,"src":2415,"##_ext":2416,"##tual":2417,"##hw":2418,"addc":2419,"##pec":2420,"##elist":2421,"int64":2422,"##ird":2423,"##irtual":2424,"exporting":2425,"##igned":2426,"adam":2427,"gradients":2428,"priv":2429,"channels":2430,"mapping":2431,"##_trans":2432,"temporarily":2433,"synchron":2434,"##pthwise":2435,"eager":2436,"free":2437,"vis":2438,"##_id":2439,"##oin":2440,"##xx":2441,"address":2442,"##storage":2443,"dev":2444,"tensoroptions":2445,"stub":2446,"char":2447,"resnet":2448,"pos":2449,"##reads":2450,"vectorize":2451,"operation":2452,"bitwise":2453,"overloads":2454,"##_model":2455,"environment":2456,"resubmit":2457,"##hwc":2458,"bench":2459,"dot":2460,"every":2461,"lr":2462,"nll":2463,"ninja":2464,"##led":2465,"real":2466,"revert":2467,"##accept":2468,"start":2469,"experi":2470,"clip":2471,"##_dir":2472,"convtranspose":2473,"prun":2474,"##_bag":2475,"##_benchmark":2476,"##const":2477,"##ready":2478,"creating":2479,"##gener":2480,"binaries":2481,"linking":2482,"threads":2483,"numbers":2484,"constants":2485,"transformer":2486,"##_cont":2487,"##_version":2488,"##ezvous":2489,"defined":2490,"dimensional":2491,"moved":2492,"##observer":2493,"##chedul":2494,"repeat":2495,"interpolate":2496,"recursive":2497,"_l":2498,"emit":2499,"loc":2500,"lamb":2501,"lapack":2502,"patch":2503,"sec":2504,"sem":2505,"xnnpack":2506,"##size":2507,"##emp":2508,"##ypes":2509,"##50":2510,"##allow":2511,"##ropy":2512,"##etensor":2513,"torchbind":2514,"them":2515,"remaining":2516,"metal":2517,"autoaccept":2518,"submodules":2519,"passing":2520,"scalar_check":2521,"##_list":2522,"##_like":2523,"layers":2524,"##_pro":2525,"##_red":2526,"##count":2527,"strings":2528,"tracer":2529,"docstrings":2530,"computation":2531,"elementwise":2532,"appro":2533,"##reshold":2534,"parsing":2535,"lazy":2536,"public":2537,"algorithm":2538,"##arrier":2539,"thctensor":2540,"private":2541,"host":2542,"rules":2543,"svd":2544,"way":2545,"##less":2546,"##get":2547,"##_assert":2548,"##ope":2549,"##ber":2550,"##ving":2551,"##vision":2552,"##anch":2553,"##loo":2554,"diag":2555,"stats":2556,"atomic":2557,"sccache":2558,"implemented":2559,"##gradient":2560,"being":2561,"##rust":2562,"graphs":2563,"search":2564,"##_num":2565,"control":2566,"weak":2567,"formul":2568,"registry":2569,"##fill":2570,"dont":2571,"initialize":2572,"proto":2573,"##implement":2574,"configur":2575,"##_env":2576,"##initial":2577,"contributing":2578,"branch":2579,"shadow":2580,"==":2581,"ax":2582,"grid":2583,"less":2584,"rank":2585,"su":2586,"##lib":2587,"##ness":2588,"##ilinear":2589,"cholesky":2590,"()`":2591,"asan":2592,"allreduce":2593,"working":2594,"respect":2595,"##_map":2596,"refactoring":2597,"override":2598,"##_hook":2599,"##lists":2600,"debugging":2601,"unittest":2602,"##weight":2603,"keys":2604,"##_relu":2605,"streams":2606,"nvcc":2607,"variants":2608,"dnnlowp":2609,"enhance":2610,"standard":2611,"references":2612,"am":2613,"sim":2614,"##lap":2615,"##margin":2616,"##iss":2617,"##hand":2618,"##helper":2619,"review":2620,"##roc":2621,"there":2622,"third":2623,"threshold":2624,"examples":2625,"suppress":2626,"##inder":2627,"implementations":2628,"##_scalar":2629,"autod":2630,"instance":2631,"metadata":2632,"##_names":2633,"libraries":2634,"specified":2635,"benchmarking":2636,"recurrent":2637,"multiprocessing":2638,"failing":2639,"##untu":2640,"exceptions":2641,"##apipe":2642,"##board":2643,"against":2644,"##qrt":2645,"deterministic":2646,"histogram":2647,"ubuntu":2648,"decorator":2649,"20":2650,"cum":2651,"how":2652,"hub":2653,"kineto":2654,"limit":2655,"##fus":2656,"##ger":2657,"##_q":2658,"##_j":2659,"##nest":2660,"##equal":2661,"##bmm":2662,"##ven":2663,"##ice":2664,"torch_check":2665,"upload":2666,"##ely":2667,"changed":2668,"##iled":2669,"##_fill":2670,"##_name":2671,"multil":2672,"pointer":2673,"container":2674,"perm":2675,"adj":2676,"backends":2677,"embedding_bag":2678,"elu":2679,"loopnest":2680,"##_conv":2681,"##process":2682,"factory":2683,"unsupported":2684,"##softmax":2685,"normalization":2686,"##method":2687,"sequential":2688,"##_python":2689,"promot":2690,"##_c10d":2691,"##_method":2692,"reorder":2693,"sparsity":2694,"cosine":2695,"__init":2696,"bce":2697,"hel":2698,"nhwc":2699,"ts":2700,"##length":2701,"##az":2702,"##rink":2703,"##12":2704,"##xy":2705,"##2c":2706,"force":2707,"##uples":2708,"dir":2709,"##aging":2710,"already":2711,"##urc":2712,"scope":2713,"isn":2714,"##_copy":2715,"##_so":2716,"run_test":2717,"##_mobile":2718,"comb":2719,"callback":2720,"boole":2721,"adv":2722,"installation":2723,"##meta":2724,"##posed":2725,"##uffle":2726,"results":2727,"assignment":2728,"osx":2729,"saved":2730,"experimental":2731,".{":2732,"1d":2733,"barrier":2734,"ded":2735,"gp":2736,"gha":2737,"join":2738,"##from":2739,"##_a":2740,"##ni":2741,"##cr":2742,"##bb":2743,"##utable":2744,"thrust":2745,"##loy":2746,"implic":2747,"##istency":2748,"profile":2749,"show":2750,"##_data":2751,"instanc":2752,"post":2753,"##_base":2754,"naming":2755,"minim":2756,"numel":2757,"leaky":2758,"packed":2759,"imports":2760,"conversions":2761,"introduc":2762,"raw":2763,"lengths":2764,"##_complex":2765,"builtin":2766,"filter":2767,"problem":2768,"adjust":2769,"__init__":2770,"12":2771,"ctc":2772,"db":2773,"flow":2774,"gil":2775,"gel":2776,"hot":2777,"hints":2778,"jen":2779,"lock":2780,"liter":2781,"pip":2782,"table":2783,"vmap":2784,"##_index":2785,"##eight":2786,"##p16":2787,"##runtime":2788,"##uch":2789,"##oull":2790,"##word":2791,"##kins":2792,"##ond":2793,"##arest":2794,"py3":2795,"##amed":2796,"##ersgd":2797,"updating":2798,"while":2799,"##iform":2800,"modern":2801,"##_caffe2":2802,"##_sparse":2803,"##_solve":2804,"seed":2805,"optimizers":2806,"across":2807,"##model":2808,"regression":2809,"miopen":2810,"functionality":2811,"##onger":2812,"rand2gen":2813,"removes":2814,"manual":2815,"##_variable":2816,"offset":2817,"division":2818,"targets":2819,"caching":2820,"##flags":2821,"##ernoull":2822,"promote":2823,"lowering":2824,"reducer":2825,"instructions":2826,"replac":2827,"renaming":2828,"implicit":2829,"jenkins":2830,"##ernoulli":2831,">=":2832,"baz":2833,"bernoulli":2834,"cap":2835,"cus":2836,"gemm":2837,"orig":2838,"pers":2839,"pull":2840,"pick":2841,"qual":2842,"was":2843,"##sampler":2844,"##_per":2845,"##_apply":2846,"##down":2847,"##blas":2848,"##ines":2849,"repo":2850,"##etch":2851,"thp":2852,"##adagrad":2853,"once":2854,"coun":2855,"##akes":2856,"stable":2857,"alp":2858,"enabling":2859,"unpack":2860,"##exp":2861,"##ormat":2862,"short":2863,"codeown":2864,"##_format":2865,"reset":2866,"##_memory":2867,"memonger":2868,"##ignore":2869,"disabled":2870,"weighted":2871,"request":2872,"##plication":2873,"wrappers":2874,"##weak":2875,"namedt":2876,"share":2877,"keyword":2878,"##ramm":2879,"features":2880,"##ogle":2881,"misc":2882,"reporting":2883,"##dataset":2884,"synt":2885,"pybind11":2886,"byte":2887,"kwargs":2888,"making":2889,"blacklist":2890,"whitelist":2891,"latest":2892,"boolean":2893,"bazel":2894,"cnn":2895,"capt":2896,"fre":2897,"give":2898,"giv":2899,"margin":2900,"s3":2901,"ter":2902,"tensort":2903,"tweak":2904,"well":2905,"##air":2906,"##_error":2907,"##nown":2908,"##19":2909,"##dist":2910,"##by":2911,"##arn":2912,"too":2913,"##utions":2914,"this":2915,"coales":2916,"tensorboard":2917,"stor":2918,"exclude":2919,"##ffine":2920,"complet":2921,"arm":2922,"convol":2923,"conv3d":2924,"improved":2925,"meta":2926,"dataset":2927,"dataparallel":2928,"passed":2929,"copy_":2930,"links":2931,"##_get":2932,"##backend":2933,"attemp":2934,"follow":2935,"definition":2936,"definitions":2937,"casting":2938,"strict":2939,"hipify":2940,"##...":2941,"segment":2942,"##boxed":2943,"##_threads":2944,"zeros":2945,"communication":2946,"differentiable":2947,"syntax":2948,"cent":2949,"called":2950,"main":2951,"push":2952,"qr":2953,"rate":2954,"safe":2955,"##fold":2956,"##gloo":2957,"##_at":2958,"##eed":2959,"##eous":2960,"##ced":2961,"##omp":2962,"##wish":2963,"##ilar":2964,"test_torch":2965,"##lop":2966,"entry":2967,"##ises":2968,"##int8":2969,"cmakelists":2970,"prepack":2971,"overhead":2972,"sparselength":2973,"returns":2974,"##_info":2975,"##_wrap":2976,"##_weight":2977,"fp32":2978,"assertion":2979,"converter":2980,"swap":2981,"sharing":2982,"trig":2983,"##attention":2984,"reductions":2985,"required":2986,"temporary":2987,"##dataparallel":2988,"propagation":2989,"kwarg":2990,"##context":2991,"makes":2992,"htt":2993,"_like":2994,"origin":2995,"convolutions":2996,"dl":2997,"each":2998,"ge":2999,"gtest":3000,"qtensor":3001,"robu":3002,"virtual":3003,"##ainder":3004,"##_put":3005,"##math":3006,"##book":3007,"##90":3008,"##->":3009,"##onical":3010,"##enable":3011,"incon":3012,"##aling":3013,"##uture":3014,"##entropy":3015,"##reg":3016,"ones":3017,"copi":3018,"dequantize":3019,"torchvision":3020,"they":3021,"remainder":3022,"upstream":3023,"uniform":3024,"shut":3025,"parse":3026,"##object":3027,"dist_":3028,"workers":3029,"##pool2d":3030,"test_nn":3031,"copying":3032,"scalartype":3033,"learning":3034,"##_pad":3035,"asserts":3036,"##engine":3037,"irange":3038,"##other":3039,"##shrink":3040,"msg":3041,"##catter":3042,"processgroupnccl":3043,"##anced":3044,"gitignore":3045,"##batchnorm":3046,"render":3047,"hardswish":3048,"second":3049,"suite":3050,"autodiff":3051,"promotion":3052,"gpus":3053,"attempt":3054,"robust":3055,"incons":3056,"aw":3057,"bmm":3058,"fav":3059,"found":3060,"gr":3061,"rng":3062,"squ":3063,"sug":3064,"##ser":3065,"##tanh":3066,"##ose":3067,"##hole":3068,"##ors":3069,"##atform":3070,"##esent":3071,"inverse":3072,"##iting":3073,"##chan":3074,"thpp":3075,"thvector":3076,"stat":3077,"buff":3078,"##older":3079,"##emb":3080,"().":3081,"disallow":3082,"runs":3083,"##_from":3084,"various":3085,"constexpr":3086,"##_min":3087,"##_not":3088,"nonzero":3089,"##_batch":3090,"sourc":3091,"##device":3092,"cpp_ext":3093,"##finite":3094,"network":3095,"fails":3096,"failures":3097,"##ucket":3098,"canonical":3099,"pointwise":3100,"brew":3101,"blocks":3102,"objects":3103,"sparset":3104,"equality":3105,"numeric":3106,"since":3107,"cublas":3108,"pipeline":3109,"axis":3110,"multilabel":3111,"codeowners":3112,"buffers":3113,"`.":3114,"label":3115,"mo":3116,"mv":3117,"pth":3118,"v2":3119,"##gather":3120,"##_pr":3121,"##nll":3122,"##table":3123,"##io":3124,"##ious":3125,"##ially":3126,"##zer":3127,"##orld":3128,"##atmul":3129,"##arrow":3130,"##array":3131,"##ade":3132,"pyi":3133,"depthwise":3134,"##ctional":3135,"expl":3136,"express":3137,"cudat":3138,"uninitial":3139,"quantizer":3140,"##elastic":3141,"##indices":3142,"##ift":3143,"arange":3144,"python3":3145,"conv1d":3146,"logsoftmax":3147,"##_mult":3148,"optimized":3149,"exporter":3150,"index_put":3151,"distributeddataparallel":3152,"folding":3153,"actually":3154,"summ":3155,"deserial":3156,"normalize":3157,"powersgd":3158,"##_sequence":3159,"optimizations":3160,"root":3161,"calculation":3162,"hardsigmoid":3163,"represent":3164,"destru":3165,"##_workers":3166,"int64_t":3167,"resnet50":3168,"semant":3169,"modernize":3170,"32":3171,"bn":3172,"bad":3173,"clo":3174,"dense":3175,"gu":3176,"gramm":3177,"ma":3178,"nested":3179,"pickler":3180,"right":3181,"squeeze":3182,"tuples":3183,"##gpu":3184,"##_int":3185,"##vious":3186,"##20":3187,"##99":3188,"##86":3189,"##atives":3190,"##item":3191,"##ities":3192,"rev":3193,"reuse":3194,"##oder":3195,"another":3196,"tensorlist":3197,"##udnn":3198,"torchelastic":3199,"remo":3200,"##olver":3201,"##fft":3202,"##ecutor":3203,"##urning":3204,"##veral":3205,"##operator":3206,"(),":3207,"typecheck":3208,"##_dep":3209,"##_split":3210,"##_scatter":3211,"changing":3212,"several":3213,"##_net":3214,"##_build":3215,"deploy":3216,"##ava":3217,"staticruntime":3218,"max_pool2d":3219,"transl":3220,"data_parallel":3221,"##_tests":3222,"platform":3223,"float16":3224,"expon":3225,"dockerfile":3226,"##_const":3227,"##bose":3228,"hardtanh":3229,"unsigned":3230,"mechan":3231,"verbose":3232,"lua":3233,"selective":3234,"peep":3235,"download":3236,"accumulate":3237,"original":3238,"copies":3239,"favor":3240,"mechanism":3241,"...":3242,"btri":3243,"ear":3244,"even":3245,"omp":3246,"slo":3247,"sampler":3248,"win":3249,"wise":3250,"zip":3251,"##future":3252,"##act":3253,"##_arch":3254,"##_args":3255,"##path":3256,"##case":3257,"##rtc":3258,"##dict":3259,"##hin":3260,"##ves":3261,"retry":3262,"##mprod":3263,"##select":3264,"##riend":3265,"unfold":3266,"##anges":3267,"##_cast":3268,"##_div":3269,"##_script":3270,"##_fl":3271,"##_fn":3272,"improvement":3273,"contrib":3274,"scriptmodule":3275,"cumprod":3276,"##maxpooling":3277,"compiling":3278,"converting":3279,"traced":3280,"symbols":3281,"statements":3282,"##prop":3283,"##_default":3284,"accur":3285,"allocation":3286,"unsqueeze":3287,"compiled":3288,"elements":3289,"declaration":3290,"specifying":3291,"rowwise":3292,"numerical":3293,"derivatives":3294,"maybe":3295,"tcpstore":3296,"formula":3297,"##implemented":3298,"advanced":3299,"namedtuple":3300,"semantics":3301,"##hinx":3302,"),":3303,"amp":3304,"friend":3305,"mention":3306,"narrow":3307,"pair":3308,"sn":3309,"san":3310,"side":3311,"schem":3312,"tp":3313,"takes":3314,"##light":3315,"##lling":3316,"##space":3317,"##mt":3318,"##ties":3319,"##17":3320,"##dot":3321,"##vial":3322,"##ared":3323,"fore":3324,"##itive":3325,"##ents":3326,"test_cuda":3327,"unb":3328,"##fact":3329,"##_types":3330,"train":3331,"isin":3332,"##ariant":3333,"##_distributed":3334,"autoc":3335,"metric":3336,"##_named":3337,"datap":3338,"datapipe":3339,"scripting":3340,"previous":3341,"##aching":3342,"##_graph":3343,"plan":3344,"##_strided":3345,"##_party":3346,"vectorized":3347,"many":3348,"refine":3349,"trivial":3350,"configs":3351,"##functions":3352,"recordfunction":3353,"##_select":3354,"verify":3355,"final":3356,"events":3357,"##_over":3358,"floor":3359,"lambda":3360,"third_party":3361,"##_softmax":3362,"##eeded":3363,"##embedding":3364,"pthread":3365,"peephole":3366,"(...":3367,"aver":3368,"ce":3369,"hal":3370,"tutor":3371,"##sc":3372,"##mv":3373,"##man":3374,"##uage":3375,"##uffer":3376,"##13":3377,"##of":3378,"##ery":3379,"##ings":3380,"toler":3381,"##ites":3382,"test_c10d":3383,"##mentum":3384,"##oll":3385,"implementing":3386,"##perm":3387,"##output":3388,"##_float":3389,"constra":3390,"resiz":3391,"preprocess":3392,"returning":3393,"##values":3394,"##leton":3395,"renorm":3396,"variabletype":3397,"ready":3398,"ability":3399,"##_pre":3400,"serialize":3401,"groups":3402,"##option":3403,"multihead":3404,"signatures":3405,"##_pool3d":3406,"feed":3407,"desc":3408,"##edian":3409,"views":3410,"processgroupgloo":3411,"longer":3412,"upsampling":3413,"ident":3414,"##_unpack":3415,"patterns":3416,"test_distributed":3417,"finish":3418,"existing":3419,"google":3420,"rendezvous":3421,"##_only":3422,"##optimizer":3423,"inlining":3424,"dilated":3425,"pruning":3426,"##cheduler":3427,"##_reduce":3428,"cumsum":3429,"gelu":3430,"##_wrapper":3431,"https":3432,"##nllcriterion":3433,"uninitialized":3434,"removal":3435,"foreach":3436,"tutorial":3437,"16":3438,"_s":3439,"__":3440,"bor":3441,"cate":3442,"face":3443,"fmod":3444,"fetch":3445,"gc":3446,"glow":3447,"lang":3448,"median":3449,"sil":3450,"ur":3451,"##son":3452,"##_nn":3453,"##_avg":3454,"##nect":3455,"##mask":3456,"##pad":3457,"##tor":3458,"##ian":3459,"##ooth":3460,"##2e":3461,"##ording":3462,"##enet":3463,"inher":3464,"##alization":3465,"##alone":3466,"##etr":3467,"##acon":3468,"cost":3469,"dequant":3470,"deleg":3471,"diff":3472,"their":3473,"supports":3474,"typed":3475,"unp":3476,"unt":3477,"##ffee":3478,"project":3479,"##_dense":3480,"cpuinfo":3481,"prelu":3482,"member":3483,"##ival":3484,"item":3485,"subclass":3486,"##devic":3487,"##_linear":3488,"dispatchkey":3489,"beta":3490,"space":3491,"sphinx":3492,"##_process":3493,"##_helper":3494,"##_tensor_apply":3495,"transforms":3496,"storageimpl":3497,"needs":3498,"##_repr":3499,"drop":3500,"##ancy":3501,"duplicated":3502,"iterator":3503,"slicing":3504,"masked_fill":3505,"trying":3506,"##_torch_function":3507,"saving":3508,"derivative":3509,"##variabletype":3510,"potr":3511,"shadowing":3512,"alpha":3513,"dlpack":3514,"(...)":3515,"facebook":3516,"14":3517,"64":3518,"__get":3519,"badd":3520,"cert":3521,"kl":3522,"mach":3523,"our":3524,"sl":3525,"ser":3526,"sle":3527,"sgd":3528,"sqrt":3529,"tree":3530,"yml":3531,"##fi":3532,"##lr":3533,"##awn":3534,"##_if":3535,"##_jit":3536,"##_point":3537,"##earest":3538,"##pri":3539,"##cod":3540,"##copy":3541,"##18":3542,"##bf":3543,"##blob":3544,"##54":3545,"toffee":3546,"##itt":3547,"addmv":3548,"reenable":3549,"confl":3550,"stuff":3551,"##anti":3552,"##app":3553,"##olid":3554,"##ffic":3555,"und":3556,"##andom":3557,"trunc":3558,"linspace":3559,"notes":3560,"##_no":3561,"##_node":3562,"##_numpy":3563,"gradgrad":3564,"spect":3565,"flip":3566,"batch_norm":3567,"##trace":3568,"regular":3569,"##oke":3570,"recv":3571,"recent":3572,"org":3573,"floating":3574,"smooth":3575,"integrate":3576,"cleanups":3577,"detach":3578,"deprecation":3579,"protot":3580,"parallelize":3581,"manager":3582,"ordering":3583,"activations":3584,"##eterministic":3585,"collect_env":3586,"mutable":3587,"##transform":3588,"##contiguous":3589,"##_library":3590,"corre":3591,"standalone":3592,"avx2":3593,"location":3594,"##handler":3595,"##rocm":3596,"introduced":3597,"freez":3598,"storages":3599,"aware":3600,"multiheadattention":3601,"conflict":3602,":/":3603,"bec":3604,"bot":3605,"bund":3606,"bilinear":3607,"criterion":3608,"flex":3609,"gflags":3610,"just":3611,"ler":3612,"land":3613,"ndim":3614,"que":3615,"qconv":3616,"sig":3617,"solve":3618,"uint8":3619,"##lder":3620,"##ause":3621,"##_indices":3622,"##pon":3623,"##ti":3624,"##bucket":3625,"##89":3626,"##55":3627,"##attr":3628,"##acc":3629,"##seg":3630,"##adam":3631,"py2":3632,