{"version":"1.0","truncation":null,"padding":null,"added_tokens":[{"id":0,"special":true,"content":"[UNK]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":1,"special":true,"content":"[CLS]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":2,"special":true,"content":"[SEP]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":3,"special":true,"content":"[PAD]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":4,"special":true,"content":"[MASK]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false}],"normalizer":{"type":"Sequence","normalizers":[{"type":"NFD"},{"type":"Lowercase"},{"type":"StripAccents"}]},"pre_tokenizer":{"type":"Whitespace"},"post_processor":{"type":"TemplateProcessing","single":[{"SpecialToken":{"id":"[CLS]","type_id":0}},{"Sequence":{"id":"A","type_id":0}},{"SpecialToken":{"id":"[SEP]","type_id":0}}],"pair":[{"SpecialToken":{"id":"[CLS]","type_id":0}},{"Sequence":{"id":"A","type_id":0}},{"SpecialToken":{"id":"[SEP]","type_id":0}},{"Sequence":{"id":"B","type_id":1}},{"SpecialToken":{"id":"[SEP]","type_id":1}}],"special_tokens":{"[CLS]":{"id":"[CLS]","ids":[1],"tokens":["[CLS]"]},"[SEP]":{"id":"[SEP]","ids":[2],"tokens":["[SEP]"]}}},"decoder":null,"model":{"type":"WordPiece","unk_token":"[UNK]","continuing_subword_prefix":"##","max_input_chars_per_word":100,"vocab":{"[UNK]":0,"[CLS]":1,"[SEP]":2,"[PAD]":3,"[MASK]":4,"!":5,"\"":6,"#":7,"$":8,"%":9,"&":10,"'":11,"(":12,")":13,"*":14,"+":15,",":16,"-":17,".":18,"/":19,"0":20,"1":21,"2":22,"3":23,"4":24,"5":25,"6":26,"7":27,"8":28,"9":29,":":30,";":31,"<":32,"=":33,">":34,"?":35,"@":36,"[":37,"\\":38,"]":39,"^":40,"_":41,"`":42,"a":43,"b":44,"c":45,"d":46,"e":47,"f":48,"g":49,"h":50,"i":51,"j":52,"k":53,"l":54,"m":55,"n":56,"o":57,"p":58,"q":59,"r":60,"s":61,"t":62,"u":63,"v":64,"w":65,"x":66,"y":67,"z":68,"{":69,"|":70,"}":71,"##r":72,"##o":73,"##c":74,"##e":75,"##s":76,"##i":77,"##n":78,"##g":79,"##t":80,"##h":81,"##u":82,"##b":83,"##_":84,"##p":85,"##y":86,"##l":87,"##w":88,"##5":89,"##3":90,"##4":91,"##v":92,"##m":93,"##a":94,"##d":95,"##9":96,"##8":97,"##2":98,"##z":99,"##1":100,"##6":101,"##7":102,"##0":103,"##f":104,"##x":105,"##k":106,"##,":107,"##-":108,"##)":109,"##/":110,"##[":111,"###":112,"##=":113,"##'":114,"##q":115,"##\"":116,"##`":117,"##<":118,"##.":119,"##j":120,"##}":121,"##]":122,"##&":123,"##:":124,"##+":125,"##>":126,"##*":127,"##(":128,"##\\":129,"##?":130,"##or":131,"##es":132,"##--":133,"##er":134,"##in":135,"th":136,"##ar":137,"##on":138,"##en":139,"##at":140,"##ch":141,"##ed":142,"##est":143,"in":144,"##it":145,"py":146,"the":147,"##an":148,"##um":149,"##----":150,"##om":151,"##orch":152,"##ing":153,"to":154,"test":155,"##mar":156,"##al":157,"pyt":158,"##ion":159,"##is":160,"##ut":161,"##le":162,"sum":163,"(#":164,"##mary":165,"summary":166,"pytorch":167,"re":168,"##ent":169,"com":170,"is":171,"##ll":172,"##od":173,"##as":174,"##et":175,"##ith":176,"for":177,"##ac":178,"fi":179,"##re":180,"##un":181,"##tt":182,"an":183,"of":184,"##ps":185,"##--------":186,"##am":187,"##ec":188,"##im":189,"##ub":190,"##dd":191,"##ic":192,"fix":193,"##ort":194,"and":195,"this":196,"##ri":197,":/":198,"htt":199,"://":200,"https":201,"##ol":202,"##ithub":203,"add":204,"github":205,"##port":206,"##ad":207,"##ly":208,"##ation":209,"##ou":210,"no":211,"##ff":212,"``":213,"be":214,"##ve":215,"##iz":216,"on":217,"##st":218,"##oc":219,"```":220,"test_":221,"##se":222,"##ce":223,"##ct":224,"con":225,"##ull":226,"wh":227,"##qu":228,"##ack":229,"##ap":230,"pull":231,"torch":232,"##==":233,"##yp":234,"op":235,"##il":236,"##ang":237,"ch":238,"##ant":239,"it":240,"##ode":241,"st":242,"im":243,"##ro":244,"##ist":245,"as":246,"##ens":247,"##ate":248,"res":249,"##ow":250,"##ab":251,"we":252,"bu":253,"##put":254,"de":255,"fr":256,"##ue":257,"##ers":258,"tests":259,"not":260,"run":261,"##ig":262,"##ip":263,"##up":264,"##ess":265,"ex":266,"##ter":267,"##ag":268,"ca":269,"with":270,"us":271,"##ur":272,"##ak":273,"from":274,"tr":275,"##e2":276,"##----------------":277,"doc":278,"sh":279,"##hon":280,"##ul":281,"##_t":282,"##ard":283,"caff":284,"##ensor":285,"pr":286,"python":287,"iss":288,"caffe2":289,"##ime":290,"##ob":291,"##id":292,"that":293,"##rad":294,"##og":295,"##el":296,"##ork":297,"##ere":298,"##atch":299,"requ":300,"##odu":301,"##ype":302,"chang":303,"out":304,"par":305,"##ore":306,"##ench":307,"##mark":308,"##rib":309,"##upport":310,"##enchmark":311,"##ror":312,"##pl":313,"##erat":314,"##ribut":315,"di":316,"##ud":317,"##ment":318,"##ame":319,"resol":320,"ne":321,"support":322,"tensor":323,"##ay":324,"when":325,"##====":326,"request":327,"##ues":328,"##ver":329,"##ved":330,"##int":331,"##ction":332,"by":333,"up":334,"##ss":335,"##if":336,"##and":337,"##ize":338,"al":339,"benchmark":340,"se":341,"##mo":342,"import":343,"##able":344,"##odule":345,"10":346,"dat":347,"sc":348,"##ck":349,"##ex":350,"##_c":351,"##pt":352,"##ward":353,"##16":354,"##all":355,"conv":356,"buck":357,"all":358,"work":359,"##..":360,"##ument":361,"##ace":362,"issues":363,"resolved":364,"()":365,"er":366,"en":367,"##ple":368,"##ld":369,"error":370,"do":371,"use":372,"##ib":373,"##_m":374,"opt":375,"##ake":376,"if":377,"qu":378,"##26":379,"##our":380,"def":381,"##ult":382,"##erator":383,"--":384,"att":385,"un":386,"##par":387,"##pec":388,"##98":389,"##90":390,"##orm":391,"##inal":392,"##unction":393,"whi":394,"diff":395,"##uda":396,"bl":397,"dist":398,"##rap":399,"##oo":400,"##os":401,"##em":402,"##th":403,"##_n":404,"##pu":405,"##py":406,"##50":407,"##ain":408,"##20":409,"int":410,"input":411,"remo":412,"##ould":413,"##antiz":414,"param":415,"##raph":416,"are":417,"back":418,"can":419,"function":420,"time":421,"val":422,"##pc":423,"##pro":424,"##vi":425,"##ail":426,"##28":427,"operator":428,"][":429,"mode":430,"was":431,"##_d":432,"##pr":433,"comm":434,"##_test":435,"distribut":436,"paramet":437,"cl":438,"mo":439,"sour":440,"var":441,"##out":442,"##so":443,"##ill":444,"##53":445,"there":446,"##ast":447,"output":448,"ap":449,"call":450,"fb":451,"fail":452,"gen":453,"id":454,"log":455,"min":456,"sig":457,"##nx":458,"##_s":459,"##po":460,"##per":461,"##ase":462,"##rect":463,"fixes":464,"##ript":465,"##--------------------------------":466,"also":467,"which":468,"source":469,"20":470,"ar":471,"cuda":472,"module":473,"pre":474,"pro":475,"sec":476,"type":477,"##ser":478,"##_f":479,"##13":480,"##18":481,"##fore":482,"##ond":483,"##edu":484,"##ass":485,"at":486,"cre":487,"code":488,"fl":489,"fx":490,"make":491,"num":492,"pip":493,"rpc":494,"su":495,"##ial":496,"##ning":497,"##type":498,"##ave":499,"##93":500,"##80":501,"##10":502,"##end":503,"##eck":504,"##stack":505,"check":506,"##igh":507,"changes":508,"need":509,"##========":510,"distributed":511,").":512,"but":513,"ci":514,"fp":515,"gh":516,"grad":517,"##rent":518,"##oad":519,"##cc":520,"##ep":521,"##tr":522,"##_g":523,"##56":524,"##57":525,"##dat":526,"##24":527,"##27":528,"##60":529,"##ions":530,"added":531,"before":532,"##str":533,"##ocess":534,"##ild":535,"##tern":536,"used":537,"##urrent":538,"document":539,"should":540,"blob":541,"backward":542,"##ight":543,"ghstack":544,"\":":545,"aut":546,"batch":547,"current":548,"fal":549,"get":550,"graph":551,"list":552,"more":553,"name":554,"or":555,"oss":556,"redu":557,"typ":558,"##ive":559,"##ax":560,"##17":561,"##eration":562,"##ine":563,"##ong":564,"##ous":565,"onnx":566,"dev":567,"true":568,"imported":569,"arg":570,"false":571,"\",":572,"af":573,"ed":574,"nn":575,"node":576,"so":577,"sy":578,"sin":579,"vers":580,"will":581,"##ot":582,"##nn":583,"##_r":584,"##_h":585,"##55":586,"##30":587,"##au":588,"##aun":589,"##2d":590,"##one":591,"##ans":592,"only":593,"##quantiz":594,"##ape":595,"build":596,"##age":597,"##ify":598,"optim":599,"quant":600,"attribut":601,"value":602,"commit":603,"second":604,"fp16":605,"after":606,"since":607,"##aunch":608,"`.":609,"case":610,"fo":611,"ops":612,"po":613,"pass":614,"size":615,"spec":616,"##con":617,"##eg":618,"##ned":619,"##ginal":620,"##les":621,"##ach":622,"##99":623,"##92":624,"##96":625,"##87":626,"##14":627,"##64":628,"intern":629,"##ity":630,"##ings":631,"repl":632,"now":633,"issue":634,"##ograd":635,"change":636,"new":637,"script":638,"allow":639,"does":640,"##ook":641,"##vious":642,"move":643,"previous":644,"autograd":645,"argument":646,"//":647,"bet":648,"bec":649,"cor":650,"dec":651,"have":652,"jit":653,"lay":654,"long":655,"ori":656,"oth":657,"pl":658,"##op":659,"##ies":660,"##ha":661,"##hod":662,"##uct":663,"##_b":664,"##_ex":665,"##low":666,"##33":667,"##ault":668,"##97":669,"##84":670,"##ary":671,"inc":672,"init":673,"##ite":674,"##ome":675,"##ethod":676,"##und":677,"off":678,"test_quantiz":679,"imple":680,"impro":681,"docs":682,"##ints":683,"scal":684,"default":685,"remove":686,"parameter":687,"numpy":688,"documentation":689,"##ause":690,"attribute":691,"internal":692,"because":693,"original":694,"implement":695,"---------------------------------":696,".,":697,"av":698,"dis":699,"fin":700,"lib":701,"linal":702,"mess":703,"sk":704,"##iv":705,"##ied":706,"##ient":707,"##time":708,"##ure":709,"##__":710,"##47":711,"##module":712,"##94":713,"##21":714,"##fx":715,"##ath":716,"##ated":717,"ret":718,"ref":719,"##act":720,"##ect":721,"adds":722,"##izer":723,"##apip":724,"##ages":725,"process":726,"##vert":727,"##andl":728,"benchmarks":729,"see":730,"##...":731,"model":732,"##rectly":733,"improve":734,"scalar":735,"linalg":736,"24":737,"==":738,"](":739,"ad":740,"bo":741,"dim":742,"ez":743,"gpu":744,"has":745,"launch":746,"mas":747,"mult":748,"rand":749,"tak":750,"ver":751,"war":752,"##ead":753,"##ir":754,"##ust":755,"##_l":756,"##42":757,"##95":758,"##68":759,"##ese":760,"##error":761,"##ence":762,"##ingle":763,"revert":764,"##aset":765,"file":766,"any":767,"##ampl":768,"##ice":769,"##ick":770,"cont":771,"##ility":772,"stack":773,"run_test":774,"##ession":775,"uses":776,"updat":777,"bucket":778,"quantiz":779,"functional":780,"parameters":781,"vari":782,"signed":783,"aten":784,"pip3":785,"reduce":786,"version":787,"other":788,"test_quantization":789,".]":790,"54":791,"[...":792,"`,":793,"cpu":794,"d2":795,"dtype":796,"em":797,"how":798,"here":799,"le":800,"mat":801,"mak":802,"pick":803,"set":804,"sim":805,"sel":806,"some":807,"tup":808,"yang":809,"zer":810,"##norm":811,"##tc":812,"##te":813,"##tm":814,"##us":815,"##ual":816,"##_o":817,"##yang":818,"##work":819,"##58":820,"##38":821,"##add":822,"##der":823,"##89":824,"##12":825,"##11":826,"##fig":827,"these":828,"##enc":829,"pytest":830,"##ish":831,"##ution":832,"report":833,"comment":834,"##llow":835,"form":836,"##ical":837,"beha":838,"##ization":839,"cons":840,"##quant":841,"str":842,"std":843,"weight":844,"bug":845,"running":846,"##ager":847,"user":848,"##urn":849,"##eld":850,"tensors":851,"data":852,"##pect":853,"##astic":854,"gener":855,"generat":856,"gradient":857,"##_grad":858,"edward":859,"sym":860,"optimizer":861,"seconds":862,"specif":863,"previously":864,"layer":865,"finish":866,"skip":867,"ezyang":868,"[...]":869,"self":870,"behavi":871,"##quantize":872,"':":873,"):":874,"...":875,"16":876,"44":877,"56":878,"57":879,"50":880,"ag":881,"acc":882,"bin":883,"bro":884,"cle":885,"el":886,"etc":887,"go":888,"ke":889,"load":890,"line":891,"man":892,"mod":893,"map":894,"match":895,"max":896,"non":897,"net":898,"per":899,"single":900,"tit":901,"tag":902,"you":903,"##rou":904,"##oid":905,"##ez":906,"##gh":907,"##ging":908,"##hape":909,"##bol":910,"##_in":911,"##_on":912,"##pp":913,"##lud":914,"##51":915,"##3d":916,"##32":917,"##40":918,"##a1":919,"##form":920,"##ke":921,"##),":922,"##erent":923,"##ating":924,"ind":925,"inst":926,"##ition":927,"too":928,"top":929,"##aload":930,"rec":931,"rel":932,"rele":933,"compr":934,"##ample":935,"fixed":936,"##rid":937,"##ations":938,"one":939,"where":940,"##apes":941,"operation":942,"##ange":943,"using":944,"##ures":945,"trans":946,"docstr":947,"dataload":948,"##ext":949,"##_co":950,"enable":951,"##_method":952,"defin":953,"unit":954,"operators":955,"api":956,"##pool":957,"##pose":958,"##================":959,"currently":960,"point":961,"scriptmodule":962,"doesn":963,"message":964,"##actor":965,"##apipe":966,"symbol":967,"title":968,"instead":969,"compression":970,"dataloader":971,"symbolic":972,"('":973,"11":974,"298":975,"30":976,"55":977,"\\.":978,"ab":979,"co":980,"col":981,"c10":982,"dt":983,"each":984,"fe":985,"job":986,"li":987,"look":988,"me":989,"met":990,"nest":991,"norm":992,"ob":993,"pos":994,"padd":995,"roc":996,"sub":997,"same":998,"ut":999,"want":1000,"##rst":1001,"##rodu":1002,"##cript":1003,"##ea":1004,"##back":1005,"##led":1006,"##59":1007,"##31":1008,"##37":1009,"##ving":1010,"##vent":1011,"##mp":1012,"##mode":1013,"##date":1014,"##dow":1015,"##fo":1016,"##fer":1017,"##ject":1018,"##---":1019,"##-------":1020,"##alle":1021,"##ention":1022,"comp":1023,"field":1024,"first":1025,"##unt":1026,"##ames":1027,"##rix":1028,"test_type":1029,"constr":1030,"what":1031,"##que":1032,"##ypy":1033,"##ypes":1034,"opin":1035,"step":1036,"##istent":1037,"asser":1038,"dep":1039,"export":1040,"example":1041,"trace":1042,"train":1043,"shape":1044,"shapes":1045,"##_time":1046,"changed":1047,"supported":1048,"update":1049,"seen":1050,"attention":1051,"##param":1052,"##pyt":1053,"into":1054,"introdu":1055,"functions":1056,"create":1057,"backwards":1058,"##_hints":1059,"follow":1060,"longer":1061,"##_benchmark":1062,"includ":1063,"----------------------------------------":1064,"refactor":1065,"bool":1066,"multip":1067,"random":1068,"##amples":1069,".],":1070,"matrix":1071,"makes":1072,"format":1073,"finished":1074,"behavior":1075,"##eze":1076,"relu":1077,"dtypes":1078,"like":1079,"padding":1080,"rocm":1081,"##allel":1082,"),":1083,"06":1084,"12":1085,"38":1086,"528":1087,"act":1088,"cal":1089,"could":1090,"don":1091,"gl":1092,"hard":1093,"handl":1094,"lin":1095,"lint":1096,"mom":1097,"mypy":1098,"nod":1099,"over":1100,"pack":1101,"qcon":1102,"ren":1103,"ran":1104,"rnn":1105,"sv":1106,"spar":1107,"te":1108,"take":1109,"tmp":1110,"wa":1111,"way":1112,"##ric":1113,"##cb":1114,"##ces":1115,"##ef":1116,"##sing":1117,"##ix":1118,"##net":1119,"##ge":1120,"##graph":1121,"##tens":1122,"##tensor":1123,"##uss":1124,"##_w":1125,"##_pr":1126,"##_out":1127,"##ply":1128,"##yle":1129,"##list":1130,"##lter":1131,"##52":1132,"##34":1133,"##ves":1134,"##vis":1135,"##vid":1136,"##85":1137,"##83":1138,"##19":1139,"##65":1140,"##ftm":1141,"##ken":1142,"##jit":1143,"##ari":1144,"##aries":1145,"##atib":1146,"inv":1147,"them":1148,"testquantize":1149,"##lect":1150,"reg":1151,"read":1152,"##ases":1153,"filter":1154,"##rec":1155,"##ream":1156,"##unk":1157,"##iment":1158,"##import":1159,"##olve":1160,"been":1161,"being":1162,"##izes":1163,"##stant":1164,"test_c":1165,"test_d":1166,"contr":1167,"##ils":1168,"iteration":1169,"stat":1170,"state":1171,"style":1172,"reset":1173,"##ables":1174,"##ability":1175,"expl":1176,"without":1177,"trac":1178,"track":1179,"shard":1180,"##ules":1181,"##ulation":1182,"##_tr":1183,"##obi":1184,"requir":1185,"directly":1186,"##ments":1187,"##ified":1188,"separ":1189,"##moid":1190,"dataset":1191,"##ex_":1192,"conv2d":1193,"errors":1194,"##ibatch":1195,"option":1196,"while":1197,"different":1198,"black":1199,"##ems":1200,"##_name":1201,"remote":1202,"backend":1203,"clar":1204,"class":1205,"call_method":1206,"failed":1207,"minor":1208,"minibatch":1209,"##periment":1210,"proper":1211,"created":1212,"numb":1213,"##ialization":1214,"changeset":1215,"needed":1216,"order":1217,"typos":1218,"device":1219,"decay":1220,"place":1221,"avoid":1222,"disc":1223,"libr":1224,"##ather":1225,"return":1226,"master":1227,"warning":1228,"updated":1229,"quantized":1230,"variable":1231,"zero":1232,"generic":1233,"generated":1234,"binary":1235,"etcd":1236,"going":1237,"keep":1238,"index_":1239,"docstrings":1240,"c10d":1241,"metric":1242,"compatib":1243,"construct":1244,"opinfo":1245,"assert":1246,"training":1247,"actual":1248,"nodes":1249,"qconfig":1250,"wait":1251,"##tensions":1252,"##ftmax":1253,"testquantizefx":1254,"separate":1255,"([":1256,"))":1257,"**":1258,"23":1259,"35":1260,"48":1261,"42":1262,"46":1263,"40":1264,"64":1265,"60":1266,"93":1267,"action":1268,"bit":1269,"cc":1270,"cpp":1271,"cases":1272,"des":1273,"dper":1274,"done":1275,"ele":1276,"eas":1277,"event":1278,"fre":1279,"giv":1280,"grou":1281,"hip":1282,"hel":1283,"hand":1284,"ker":1285,"lat":1286,"las":1287,"loc":1288,"last":1289,"mis":1290,"mic":1291,"may":1292,"method":1293,"ns":1294,"names":1295,"occ":1296,"pt":1297,"pri":1298,"rre":1299,"rate":1300,"sort":1301,"save":1302,"sizes":1303,"tim":1304,"were":1305,"##rc":1306,"##ry":1307,"##ration":1308,"##oss":1309,"##c7":1310,"##ced":1311,"##cce":1312,"##code":1313,"##e7":1314,"##ell":1315,"##eve":1316,"##eager":1317,"##sen":1318,"##san":1319,"##ier":1320,"##ias":1321,"##ne":1322,"##nel":1323,"##gd":1324,"##gor":1325,"##ting":1326,"##user":1327,"##bo":1328,"##_k":1329,"##_un":1330,"##_st":1331,"##_id":1332,"##por":1333,"##ped":1334,"##pace":1335,"##way":1336,"##35":1337,"##36":1338,"##43":1339,"##48":1340,"##vant":1341,"##vate":1342,"##mm":1343,"##match":1344,"##a3":1345,"##a2":1346,"##af":1347,"##ding":1348,"##91":1349,"##1d":1350,"##1_n":1351,"##62":1352,"##70":1353,"##for":1354,"##ins":1355,"than":1356,"##arn":1357,"##ator":1358,"##iter":1359,"##-----":1360,"##omot":1361,"##ise":1362,"comput":1363,"##oder":1364,"##acy":1365,"##aces":1366,"##read":1367,"##ecess":1368,"##ict":1369,"##ices":1370,"##icit":1371,"##olution":1372,"adding":1373,"nosan":1374,"below":1375,"##vel":1376,"##oc_ex":1377,"test_f":1378,"test_nn":1379,"test_time":1380,"##cept":1381,"cond":1382,"constant":1383,"torchel":1384,"chunk":1385,"resnet":1386,"##abled":1387,"runtime":1388,"exec":1389,"expect":1390,"experiment":1391,"except":1392,"##agne":1393,"##uring":1394,"shut":1395,"##_tensor":1396,"##_type":1397,"pres":1398,"print":1399,"##obar":1400,"parent":1401,"requests":1402,"##_cpu":1403,"##ptim":1404,"conv3d":1405,"worker":1406,"workers":1407,"().":1408,"ens":1409,"##982":1410,"##oses":1411,"integ":1412,"valid":1413,"values":1414,"operator_benchmark":1415,"closes":1416,"most":1417,"var2":1418,"var1":1419,"fbcode":1420,"failures":1421,"logic":1422,"logging":1423,"sigmoid":1424,"##-------------------------------------":1425,"flo":1426,"flag":1427,"such":1428,"sure":1429,"##936":1430,"batchnorm":1431,"graphmode":1432,"typo":1433,"softmax":1434,"versions":1435,"##_rpc":1436,"building":1437,"foobar":1438,"replic":1439,"replace":1440,"arguments":1441,"correct":1442,"correctly":1443,"init_rpc":1444,"----------------------------------------------------------------------":1445,"avg":1446,"disable":1447,"adam":1448,"mask":1449,"taken":1450,"context":1451,"updates":1452,"quantization":1453,"pickle":1454,"tuple":1455,"tuples":1456,"##used":1457,"##ency":1458,"reports":1459,"##ically":1460,"consistent":1461,"struct":1462,"again":1463,"broken":1464,"clean":1465,"elastic":1466,"matching":1467,"##_init":1468,"##_onnx":1469,"topk":1470,"relevant":1471,"##ride":1472,"defined":1473,"collect":1474,"jobs":1475,"normal":1476,"object":1477,"utils":1478,"test_type_hints":1479,"deprec":1480,"##params":1481,"following":1482,"include":1483,"calc":1484,"lines":1485,"moment":1486,"sparsen":1487,"##vided":1488,"test_cuda":1489,"test_doc_ex":1490,"sharded":1491,"##obile":1492,"requires":1493,"blacklist":1494,"clarify":1495,"discuss":1496,"libraries":1497,"freeze":1498,"handle":1499,"lasagne":1500,"micro":1501,"occur":1502,"private":1503,"rref":1504,"torchelastic":1505,"expected":1506,"sparsenn":1507,"test_doc_examples":1508,"\".":1509,"\"}":1510,"')":1511,"++":1512,"1e":1513,"15":1514,"18":1515,"17":1516,"294":1517,"328":1518,"47":1519,"58":1520,"62":1521,"61":1522,"613":1523,"=\"":1524,">>":1525,"_c":1526,"_con":1527,"`'":1528,"aro":1529,"bas":1530,"bre":1531,"bias":1532,"cr":1533,"cod":1534,"cate":1535,"cust":1536,"det":1537,"due":1538,"did":1539,"fut":1540,"full":1541,"gather":1542,"hell":1543,"ig":1544,"just":1545,"let":1546,"leg":1547,"ms":1548,"mu":1549,"mad":1550,"mul":1551,"mem":1552,"nv":1553,"none":1554,"old":1555,"pn":1556,"pat":1557,"que":1558,"ra":1559,"right":1560,"sm":1561,"slow":1562,"sque":1563,"win":1564,"{\"":1565,"##run":1566,"##redu":1567,"##rocess":1568,"##ops":1569,"##o_d":1570,"##ound":1571,"##cod":1572,"##cff":1573,"##cast":1574,"##ean":1575,"##ever":1576,"##sh":1577,"##sig":1578,"##script":1579,"##i_":1580,"##ian":1581,"##nc":1582,"##nor":1583,"##necess":1584,"##gg":1585,"##grad":1586,"##ta":1587,"##tal":1588,"##tent":1589,"##bu":1590,"##b4":1591,"##batch":1592,"##_en":1593,"##_all":1594,"##_pyt":1595,"##_eager":1596,"##pha":1597,"##ling":1598,"##line":1599,"##loss":1600,"##513":1601,"##350":1602,"##313":1603,"##397":1604,"##44":1605,"##vers":1606,"##mod":1607,"##aa":1608,"##d0":1609,"##9d":1610,"##88":1611,"##2e":1612,"##256":1613,"##6e":1614,"##63":1615,"##61":1616,"##618":1617,"##6_cpu":1618,"##75":1619,"##78":1620,"##77":1621,"##fb":1622,"##fil":1623,"##ks":1624,"##ky":1625,"##ory":1626,"##ording":1627,"##es_t":1628,"##esky":1629,"##ered":1630,"##ering":1631,"##erence":1632,"##ind":1633,"then":1634,"##are":1635,"##arning":1636,"##around":1637,"##ense":1638,"##ative":1639,"ins":1640,"##itive":1641,"they":1642,"##ank":1643,"##umer":1644,"##omment":1645,"tool":1646,"total":1647,"testim":1648,"testfx":1649,"##let":1650,"pytorchob":1651,"pytorch_b":1652,"reas":1653,"##ential":1654,"##acond":1655,"files":1656,"##reach":1657,"##ttime":1658,"anacond":1659,"##uble":1660,"##olesky":1661,"add_":1662,"githubuser":1663,"##adcast":1664,"##ough":1665,"ones":1666,"##stem":1667,"test_s":1668,"test_l":1669,"test_pyt":1670,"test_jit":1671,"config":1672,"torchvis":1673,"##anges_t":1674,"cholesky":1675,"its":1676,"still":1677,"stream":1678,"images":1679,"##ross":1680,"##ension":1681,"result":1682,"respect":1683,"reshape":1684,"well":1685,"frame":1686,"note":1687,"extr":1688,"within":1689,"users":1690,"show":1691,"##ardings":1692,"python3":1693,"##ide":1694,"##idered":1695,"##atchnorm":1696,"parallel":1697,"parsing":1698,"resolve":1699,"##ssib":1700,"##ific":1701,"alpha":1702,"benchmarking":1703,"benchmark_all":1704,"seems":1705,"100":1706,"datapip":1707,"datapipe":1708,"##_con":1709,"convolution":1710,"allredu":1711,"works":1712,"working":1713,"workaround":1714,"enables":1715,"double":1716,"##_m1_n":1717,"##_mean":1718,"##264":1719,"unnecess":1720,"##900":1721,"##prop":1722,"##_di":1723,"##_dim":1724,"command":1725,"output2":1726,"calling":1727,"logit":1728,"##_sh":1729,"206":1730,"2020":1731,"prob":1732,"provided":1733,"##server":1734,"##_fork":1735,"creating":1736,"rpc_fork":1737,"suite":1738,"##ializ":1739,"##807":1740,"checks":1741,"gradgrad":1742,"##trans":1743,"##570":1744,"##dataset":1745,"##datapipe":1746,"##246":1747,"reduction":1748,"typing":1749,"##ively":1750,"devices":1751,"edge":1752,"system":1753,"##_ranges_t":1754,"possib":1755,"##content":1756,"##999":1757,"scripting":1758,"allows":1759,"better":1760,"beta1":1761,"beta2":1762,"decor":1763,"##_extensions":1764,"incor":1765,"attributeerror":1766,"implementation":1767,"messages":1768,"##470":1769,"retri":1770,"reference":1771,"##andler":1772,"both":1773,"dimension":1774,"randn":1775,"takes":1776,"very":1777,"warm":1778,"##ampler":1779,"bucketbatch":1780,"emas":1781,"however":1782,"learning":1783,"simple":1784,"##tml":1785,"##_ops":1786,"##_optim":1787,"considered":1788,"std_mean":1789,"data_":1790,"general":1791,"specific":1792,"skipped":1793,"according":1794,"broadcast":1795,"clear":1796,"manager":1797,"modules":1798,"network":1799,"recom":1800,"##_count":1801,"##================================":1802,"29890":1803,"29892":1804,"about":1805,"copy":1806,"few":1807,"meas":1808,"nested":1809,"position":1810,"positive":1811,"##dows":1812,"##down":1813,"##ference":1814,"introduced":1815,"multiply":1816,"multiprocess":1817,"gloo":1818,"handling":1819,"packages":1820,"rename":1821,"svg":1822,"##efin":1823,"##_promot":1824,"##_output":1825,"regist":1826,"control":1827,"tracer":1828,"##_trans":1829,"properly":1830,"numbers":1831,"compatible":1832,"constructor":1833,"testquantizefxops":1834,"600":1835,"descript":1836,"element":1837,"given":1838,"group":1839,"hipify":1840,"help":1841,"keras":1842,"latency":1843,"local":1844,"methods":1845,"##_k313":1846,"##porttime":1847,"test_foo":1848,"condition":1849,"resnet18":1850,"experimental":1851,"shutdown":1852,"replica":1853,"avgpool":1854,"normalize":1855,"deprecate":1856,"momentum":1857,"shardedtensor":1858,">>>":1859,"_conv":1860,"around":1861,"break":1862,"categor":1863,"custom":1864,"hello":1865,"ignor":1866,"legacy":1867,"made":1868,"png":1869,"pattern":1870,"queue":1871,"small":1872,"windows":1873,"##o_dense":1874,"##shardings":1875,"##_env":1876,"##256_k313":1877,"##6_cpu_eager":1878,"testimporttime":1879,"pytorchobserver":1880,"pytorch_batchnorm":1881,"reason":1882,"##reachable":1883,"githubusercontent":1884,"torchvision":1885,"respectively":1886,"framework":1887,"extra":1888,"datapipes":1889,"allreduce":1890,"##_m1_n256_k313":1891,"##_ranges_to_dense":1892,"multiprocessing":1893,"##shardingspec":1894,"pytorch_batchnorm_m1_n256_k313":1895,"pytorch_batchnorm_m1_n256_k3136_cpu_eager":1896,"![":1897,"\"/":1898,"%)":1899,"',":1900,"(...":1901,"./":1902,"..":1903,"/?":1904,"19":1905,"128":1906,"127":1907,"114":1908,"164":1909,"2e":1910,"22":1911,"290":1912,"31":1913,"36":1914,"353":1915,"360":1916,"416":1917,"413":1918,"457":1919,"460":1920,"499":1921,"459":1922,"4807":1923,"5s":1924,"52":1925,"555":1926,"537":1927,"632":1928,"75":1929,"748":1930,"85":1931,"81":1932,"86":1933,"824":1934,"99":1935,"955":1936,":`":1937,"::":1938,"],":1939,"__m":1940,"__d":1941,"__g":1942,"__init":1943,"`)":1944,"`--":1945,"aim":1946,"acce":1947,"br":1948,"bv":1949,"bar":1950,"base":1951,"bmm":1952,"cat":1953,"cou":1954,"cud":1955,"cnn":1956,"dd":1957,"dum":1958,"dom":1959,"dro":1960,"d28":1961,"d19":1962,"dict":1963,"during":1964,"d246":1965,"eps":1966,"equ":1967,"ever":1968,"e30":1969,"e2e":1970,"fall":1971,"face":1972,"fake":1973,"foo":1974,"fused":1975,"gr":1976,"gu":1977,"gem":1978,"h_":1979,"hook":1980,"hop":1981,"home":1982,"hints":1983,"hence":1984,"html":1985,"ir":1986,"jo":1987,"lr":1988,"lu":1989,"ll":1990,"len":1991,"lam":1992,"lim":1993,"less":1994,"l53":1995,"mr":1996,"my":1997,"md":1998,"mig":1999,"might":2000,"np":2001,"nll":2002,"native":2003,"os":2004,"ow":2005,"our":2006,"pe":2007,"pm":2008,"pin":2009,"put":2010,"pad":2011,"pow":2012,"pur":2013,"past":2014,"path":2015,"qr":2016,"rff":2017,"rend":2018,"sw":2019,"ser":2020,"sch":2021,"site":2022,"solve":2023,"src":2024,"sgd":2025,"tw":2026,"ter":2027,"tin":2028,"tri":2029,"turn":2030,"text":2031,"vi":2032,"v2":2033,"void":2034,"wip":2035,"would":2036,"xm":2037,"ye":2038,"yi":2039,"yet":2040,"},":2041,"##ral":2042,"##ret":2043,"##rate":2044,"##rand":2045,"##over":2046,"##ople":2047,"##ci":2048,"##cd":2049,"##cis":2050,"##cross":2051,"##cret":2052,"##eb":2053,"##ev":2054,"##een":2055,"##eat":2056,"##eight":2057,"##sampler":2058,"##s_ops":2059,"##ily":2060,"##iability":2061,"##ieve":2062,"##ns":2063,"##nd":2064,"##nam":2065,"##not":2066,"##to":2067,"##ten":2068,"##torch":2069,"##tic":2070,"##tings":2071,"##tins":2072,"##hing":2073,"##hel":2074,"##hot":2075,"##hints":2076,"##head":2077,"##uec":2078,"##uff":2079,"##bc":2080,"##bb":2081,"##by":2082,"##bl":2083,"##bd":2084,"##bos":2085,"##b87":2086,"##book":2087,"##b83":2088,"##bmm":2089,"##_v":2090,"##_a":2091,"##_q":2092,"##_it":2093,"##_le":2094,"##_pro":2095,"##_quantiz":2096,"##_enc":2097,"##_jit":2098,"##_import":2099,"##pon":2100,"##ping":2101,"##pens":2102,"##path":2103,"##ync":2104,"##lerat":2105,"##lator":2106,"##lhel":2107,"##wise":2108,"##ween":2109,"##5d":2110,"##5f":2111,"##553":2112,"##320":2113,"##318":2114,"##392":2115,"##387":2116,"##342":2117,"##451":2118,"##4b4":2119,"##val":2120,"##my":2121,"##min":2122,"##a92":2123,"##avers":2124,"##do":2125,"##ds":2126,"##d4":2127,"##df":2128,"##defin":2129,"##9b":2130,"##926":2131,"##956":2132,"##927":2133,"##82":2134,"##813":2135,"##22":2136,"##2f":2137,"##2570":2138,"##zo":2139,"##15":2140,"##116":2141,"##120":2142,"##193":2143,"##67":2144,"##621":2145,"##7f":2146,"##798":2147,"##0c":2148,"##01":2149,"##f3":2150,"##fd":2151,"##fin":2152,"##fos":2153,"##flow":2154,"##f4b4":2155,"##xt":2156,"##ket":2157,"##kill":2158,"##just":2159,"##],":2160,"##])":2161,"##ors":2162,"##or_m":2163,"##erry":2164,"##ink":2165,"##inom":2166,"##inter":2167,"##in_time":2168,"things":2169,"throu":2170,"##art":2171,"##arch":2172,"##arallel":2173,"##eness":2174,"##ename":2175,"##ates":2176,"##atter":2177,"##atten":2178,"##ching":2179,"##edund":2180,"##edshardingspec":2181,"##edrand":2182,"##estig":2183,"inpl":2184,"inference":2185,"##its":2186,"##anation":2187,"##ance":2188,"##annel":2189,"##umns":2190,"##omal":2191,"##ompr":2192,"##omsampler":2193,"##orch_onnx":2194,"##ing_f":2195,"##ing_le":2196,"toward":2197,"todo":2198,"tested":2199,"testing":2200,"testtype":2201,"##ale":2202,"##alid":2203,"##ionerror":2204,"##iscret":2205,"##lem":2206,"rely":2207,"repr":2208,"repo":2209,"##entro":2210,"##llate":2211,"forward":2212,"##reate":2213,"##unic":2214,"##amp":2215,"##uberry":2216,"##ics":2217,"fixing":2218,"##rieg":2219,"##olog":2220,"##adel":2221,"##ffect":2222,"##fferent":2223,"beam":2224,"once":2225,"onto":2226,"##stance":2227,"##ocations":2228,"test_m":2229,"test_st":2230,"test_fx":2231,"test_import":2232,"test_match":2233,"test_torch":2234,"##ce24":2235,"conc":2236,"conf":2237,"##appro":2238,"##aparallel":2239,"torchscript":2240,"##yptic":2241,"open":2242,"##ilu":2243,"##ilon":2244,"##ilter":2245,"##iltins":2246,"channel":2247,"item":2248,"stable":2249,"stage":2250,"stride":2251,"impl":2252,"ask":2253,"assig":2254,"##ably":2255,"##pute":2256,"##ersion":2257,"##ers_test":2258,"##ersgd":2259,"##ipulation":2260,"##ess_h":2261,"ext":2262,"exist":2263,"extensions":2264,"usr":2265,"##aky":2266,"short":2267,"share":2268,"##ular":2269,"##_torch":2270,"caffe":2271,"prs":2272,"issuec":2273,"##obal":2274,"##elog":2275,"changelog":2276,"part":2277,"##upported":2278,"##plied":2279,"##ributing":2280,"resolution":2281,"resolves":2282,"never":2283,"next":2284,"##ays":2285,"##verse":2286,"##ize_f":2287,"alway":2288,"alread":2289,"sequ":2290,"##moket":2291,"1024":2292,"dataparallel":2293,"scre":2294,"##_cuda":2295,"##_cach":2296,"##_c64":2297,"##_compr":2298,"conv_test":2299,"conv1d":2300,"conv_trans":2301,"conversion":2302,"()),":2303,"encod":2304,"enough":2305,"##ibration":2306,"##_module":2307,"options":2308,"##265":2309,"##268":2310,"##262570":2311,"under":2312,"undefin":2313,"##parent":2314,"##984":2315,"##901":2316,"##90392":2317,"##unctions":2318,"blank":2319,"##os_":2320,"##ema":2321,"##ther":2322,"##thing":2323,"##_nn":2324,"##_node":2325,"##_neg":2326,"##509":2327,"##508":2328,"##ained":2329,"##ain_d":2330,"##ain__":2331,"##204":2332,"inputs":2333,"removing":2334,"removes":2335,"##ailure":2336,"##_dev":2337,"##process":2338,"communic":2339,"distribution":2340,"clamp":2341,"moving":2342,"##533":2343,"##530":2344,"therefore":2345,"output1":2346,"output_di":2347,"apis":2348,"apply":2349,"applied":2350,"apparent":2351,"calls":2352,"called":2353,"idx":2354,"logs":2355,"log_pro":2356,"sign":2357,"sigkill":2358,"##_size":2359,"##_shape":2360,"##_smoket":2361,"prepar":2362,"prop":2363,"##_filter":2364,"flow":2365,"flatten":2366,"flaky":2367,"succe":2368,"##802":2369,"##ending":2370,"checking":2371,"circ":2372,"##_graph":2373,"##56e":2374,"##568":2375,"##56a92":2376,"##572":2377,"##275":2378,"##607":2379,"blobs":2380,"gets":2381,"lists":2382,"org":2383,"types":2384,"##178":2385,"##170":2386,"##_range":2387,"##_handler":2388,"##55999":2389,"##3091":2390,"##augh":2391,"builds":2392,"##ifying":2393,"optimize_f":2394,"quants":2395,"attributes":2396,"fp16_compr":2397,"##auncher":2398,"found":2399,"passed":2400,"passing":2401,"##96397":2402,"##143091":2403,"replac":2404,"replaces":2405,"allow_un":2406,"between":2407,"decoder":2408,"layers":2409,"longest":2410,"others":2411,"plan":2412,"places":2413,"##operator":2414,"##opquantize":2415,"##337":2416,"##3359":2417,"##973":2418,"##97f":2419,"##844":2420,"incre":2421,"initialization":2422,"initializ":2423,"test_quantized":2424,"default_co":2425,"internally":2426,"##ivation":2427,"##479":2428,"##215":2429,"model_name":2430,"improvements":2431,"adjust":2432,"adadel":2433,"taking":2434,"verified":2435,"verbos":2436,"##_len":2437,"##_list":2438,"##_launch":2439,"##42c7":2440,"##688":2441,"anyone":2442,"anything":2443,"##ice_count":2444,"contributing":2445,"stacks":2446,"variables":2447,"otherwise":2448,".]])":2449,"54451":2450,"54926":2451,"d252":2452,"d290392":2453,"d296397":2454,"making":2455,"pickling":2456,"settings":2457,"simpl":2458,"simply":2459,"zeros_":2460,"##ualization":2461,"##workers_test":2462,"##585":2463,"##ences":2464,"comments":2465,"##llowfin":2466,"strange":2467,"weightedrand":2468,"##elds":2469,"tensorshape":2470,"tensorsolve":2471,"generates":2472,"gradients":2473,"specified":2474,"specifically":2475,"layer_name":2476,"behaviour":2477,"...],":2478,"44973":2479,"44844":2480,"562":2481,"5638":2482,"57508":2483,"57802":2484,"50116":2485,"50901":2486,"access":2487,"eli":2488,"key":2489,"load_in":2490,"many":2491,"modify":2492,"modified":2493,"mapiter":2494,"mapping":2495,"maxpool":2496,"tags":2497,"tag_filter":2498,"##_only":2499,"##a1f4b4":2500,"##forms":2501,"took":2502,"topolog":2503,"recent":2504,"release":2505,"operations":2506,"transform":2507,"transfer":2508,"docstring":2509,"definite":2510,"pointed":2511,"symbolics":2512,"11ea":2513,"3084":2514,"55533":2515,"55479":2516,"count":2517,"columns":2518,"feed":2519,"looks":2520,"nesting_le":2521,"obser":2522,"subprocess":2523,"##ea3359":2524,"##modelhel":2525,"test_type_promot":2526,"depend":2527,"traceback":2528,"introduces":2529,"##_hints_smoket":2530,"includes":2531,"padding_id":2532,"52865":2533,"52863":2534,"global":2535,"handler":2536,"renames":2537,"svd":2538,"team":2539,"##ixed":2540,"##graphmatch":2541,"##_warn":2542,"##_weight":2543,"##arily":2544,"##ariable":2545,"investig":2546,"invalid":2547,"iterations":2548,"stats_ops":2549,"statements":2550,"explicit":2551,"explanation":2552,"optional":2553,"remotely":2554,"minibatches":2555,"number":2556,"zero_grad":2557,"generated_type":2558,"binaryopquantize":2559,"keeping":2560,"index_put":2561,"index_que":2562,"compatibility":2563,"constructing":2564,"assertionerror":2565,"actually":2566,"waitfor":2567,"([[":2568,")).":2569,"2314":2570,"48aa":2571,"42900":2572,"cpp_extensions":2573,"dper3":2574,"easier":2575,"event_dim":2576,"missing":2577,"times":2578,"##e7982":2579,"##_stat":2580,"##iterabled":2581,"compute":2582,"computation":2583,"test_nn_quantiz":2584,"test_time_import":2585,"test_time_cuda":2586,"chunkedshardingspec":2587,"execut":2588,"execution":2589,"exception":2590,"exceptions":2591,"present":2592,"ensure":2593,"ensuring":2594,"integration":2595,"integral":2596,"float":2597,"floating":2598,"replacement":2599,"against":2600,"elastic_launch":2601,"##_onnxrun":2602,"collect_env":2603,"calculation":2604,"requires_grad":2605,"discussed":2606,"discussion":2607,"occurs":2608,"3280":2609,"61265":2610,"61328":2611,"_create":2612,"based":2613,"cryptic":2614,"coded":2615,"future":2616,"gather_ranges_to_dense":2617,"lets":2618,"much":2619,"memory":2620,"nvcc":2621,"rais":2622,"squeeze":2623,"##cffe7982":2624,"##build":2625,"##_python":2626,"##449":2627,"##modules":2628,"##filename":2629,"##umerics":2630,"testfxgraphmatch":2631,"anaconda3":2632,"ones_":2633,"test_launcher":2634,"test_pytorch_onnx":2635,"benchmark_all_test":2636,"workspace":2637,"unnecessary":2638,"commands":2639,"problem":2640,"##transform":2641,"possible":2642,"decorator":2643,"incorrect":2644,"retrieve":2645,"dimensional":2646,"data_workers_test":2647,"networkx":2648,"recompute":2649,"copy_":2650,"measure":2651,"multiplying":2652,"60020":2653,"description":2654,"groupby":2655,"helpers":2656,"_convnd":2657,"categorical":2658,"customdataset":2659,"(...),":2660,"36083":2661,"45775":2662,"49957":2663,"48073":2664,"55547":2665,"__main__":2666,"__get":2667,"__init__":2668,"accelerat":2669,"bvaugh":2670,"couple":2671,"cudnn":2672,"cnnmodelhel":2673,"ddp":2674,"dummy":2675,"domain_d":2676,"drop":2677,"d28143091":2678,"d19262570":2679,"d24655999":2680,"epsilon":2681,"every":2682,"fallback":2683,"facebook":2684,"gemm":2685,"join_time":2686,"lambd":2687,"mruberry":2688,"migrate":2689,"nllloss":2690,"own":2691,"people":2692,"powersgd":2693,"purpose":2694,"rendering":2695,"swit":2696,"serialization":2697,"schema":2698,"two":2699,"termin":2700,"tiny":2701,"via":2702,"xml":2703,"yellowfin":2704,"yields":2705,"##crossentro":2706,"##b8742c7":2707,"##_variable":2708,"##_qparams":2709,"##_iteration":2710,"##_encoder":2711,"##22215":2712,"##or_mobile":2713,"##inomial":2714,"through":2715,"inplace":2716,"##omaly":2717,"##ing_failure":2718,"towards":2719,"testtypehints":2720,"##iscrete":2721,"##riegas":2722,"##fferentiability":2723,"test_matching_failure":2724,"##ce24b8742c7":2725,"implicit":2726,"assigned":2727,"##ess_hook":2728,"issuecomment":2729,"already":2730,"##_cache":2731,"conv_transpose":2732,"encoding":2733,"undefined":2734,"##_device_count":2735,"communicate":2736,"output_differentiability":2737,"log_prob":2738,"succeed":2739,"optimize_for_mobile":2740,"fp16_compress_hook":2741,"allow_unreachable":2742,"default_collate":2743,"adadelta":2744,"verbosity":2745,"d25222215":2746,"d29039238":2747,"d29639797":2748,"weightedrandomsampler":2749,"load_inline":2750,"mapiterdatapipe":2751,"##a1f4b456a92":2752,"topological":2753,"nesting_level":2754,"##ea3359cffe7982":2755,"test_type_promotion":2756,"##_hints_smoketest":2757,"padding_idx":2758,"investigate":2759,"stats_ops_test":2760,"explicitly":2761,"generated_type_hints_smoketest":2762,"binaryopquantizeh":2763,"48aaea3359cffe7982":2764,"test_nn_quantized":2765,"test_time_import_torch":2766,"test_time_cuda_device_count":2767,"##_onnxruntime":2768,"testfxgraphmatcher":2769,"test_pytorch_onnx_onnxruntime":2770,"groupbyfilename":2771,"accelerated":2772,"bvaughan":2773,"cnnmodelhelper":2774,"domain_discrete":2775,"join_timeout":2776,"lambda":2777,"terminate":2778,"##crossentropy":2779,"test_matching_failure_node":2780,"##ce24b8742c7a1f4b456a92":2781,"48aaea3359cffe7982ce24b8742c7a1f4b456a92":2782,"\"[":2783,"\"'":2784,"\"]":2785,"\">":2786,"&&":2787,"'`":2788,"'),":2789,"(<":2790,")\"":2791,")`":2792,")]":2793,")),":2794,"*.":2795,"+`":2796,",)":2797,"-/":2798,"->":2799,"---":2800,".)":2801,"/)":2802,"/#":2803,"/`":2804,"0b":2805,"05":2806,"03":2807,"09":2808,"01":2809,"07":2810,"00":2811,"0x":2812,"096":2813,"14":2814,"116":2815,"126":2816,"150":2817,"118":2818,"124":2819,"160":2820,"117":2821,"130":2822,"196":2823,"194":2824,"132":2825,"152":2826,"134":2827,"135":2828,"1936":2829,"1470":2830,"1568":2831,"1585":2832,"25":2833,"2a":2834,"27":2835,"216":2836,"226":2837,"280":2838,"224":2839,"227":2840,"230":2841,"287":2842,"295":2843,"251":2844,"285":2845,"2936":2846,"277":2847,"2813":2848,"2120":2849,"2509":2850,"34":2851,"3d":2852,"37":2853,"316":2854,"357":2855,"317":2856,"355":2857,"330":2858,"387":2859,"384":2860,"358":2861,"340":2862,"3397":2863,"378":2864,"3387":2865,"3956":2866,"397f":2867,"45":2868,"43":2869,"4a":2870,"49":2871,"426":2872,"450":2873,"456":2874,"455":2875,"430":2876,"492":2877,"496":2878,"414":2879,"484":2880,"447":2881,"468":2882,"489":2883,"412":2884,"431":2885,"4936":2886,"4513":2887,"4d0":2888,"4bc":2889,"4337":2890,"59":2891,"526":2892,"598":2893,"590":2894,"593":2895,"527":2896,"560":2897,"596":2898,"587":2899,"533":2900,"597":2901,"584":2902,"521":2903,"595":2904,"568":2905,"558":2906,"511":2907,"585":2908,"536":2909,"5350":2910,"5470":2911,"5170":2912,"69":2913,"650":2914,"620":2915,"628":2916,"618":2917,"657":2918,"660":2919,"617":2920,"633":2921,"611":2922,"631":2923,"74":2924,"78":2925,"72":2926,"7f":2927,"721":2928,"736":2929,"788":2930,"775":2931,"7193":2932,"7621":2933,"853":2934,"827":2935,"855":2936,"895":2937,"851":2938,"836":2939,"8900":2940,"8688":2941,"9ec":2942,"952":2943,"9a2":2944,"9d0":2945,"9fb":2946,"90c":2947,":)":2948,":\\":2949,"<=":2950,"=/":2951,"='":2952,"=================================":2953,">,":2954,"[\"":2955,"[`":2956,"[]":2957,"\\)":2958,"\\#":2959,"\\(":2960,"])":2961,"]),":2962,"_s":2963,"_t":2964,"_l":2965,"_int":2966,"_all":2967,"__n":2968,"_bo":2969,"__len":2970,"`-":2971,"`:":2972,"`(":2973,"ao":2974,"aw":2975,"am":2976,"az":2977,"ach":2978,"aver":2979,"ai_":2980,"ahead":2981,"affect":2982,"bb":2983,"ber":2984,"best":2985,"b20":2986,"badd":2987,"ce":2988,"cb":2989,"c4":2990,"cd":2991,"c2":2992,"cer":2993,"cap":2994,"catch":2995,"cour":2996,"cos":2997,"cast":2998,"cop":2999,"cross":3000,"da":3001,"der":3002,"den":3003,"ded":3004,"dest":3005,"ddd":3006,"dic":3007,"dil":3008,"dow":3009,"dup":3010,"d50":3011,"d470":3012,"days":3013,"d449":3014,"eu":3015,"ear":3016,"eith":3017,"ess":3018,"epo":3019,"eigh":3020,"eager":3021,"eins":3022,"eval":3023,"effect":3024,"fc":3025,"fn":3026,"fa":3027,"f7":3028,"f0":3029,"fch":3030,"fet":3031,"fun":3032,"fol":3033,"fou":3034,"fur":3035,"final":3036,"factor":3037,"fuser":3038,"gb":3039,"gum":3040,"gist":3041,"gcc":3042,"give":3043,"got":3044,"gone":3045,"glow":3046,"gunk":3047,"hu":3048,"ha":3049,"hon":3050,"hub":3051,"had":3052,"hou":3053,"hack":3054,"hap":3055,"hyp":3056,"hess":3057,"hint":3058,"hparam":3059,"harn":3060,"io":3061,"js":3062,"jac":3063,"ks":3064,"kn":3065,"k3":3066,"kill":3067,"kind":3068,"l6":3069,"lst":3070,"lack":3071,"lag":3072,"lex":3073,"l26":3074,"l10":3075,"lints":3076,"l47":3077,"loss":3078,"l342":3079,"mi":3080,"ma":3081,"mer":3082,"mar":3083,"med":3084,"mal":3085,"moc":3086,"mist":3087,"main":3088,"math":3089,"must":3090,"mobile":3091,"mtml":3092,"mixed":3093,"nh":3094,"nm":3095,"nch":3096,"ncc":3097,"necess":3098,"ok":3099,"pd":3100,"pk":3101,"pse":3102,"pap":3103,"pep":3104,"pus":3105,"pix":3106,"qact":3107,"qtensor":3108,"qparams":3109,"rp":3110,"rm":3111,"rd":3112,"rest":3113,"race":3114,"roo":3115,"range":3116,"rprop":3117,"redund":3118,"ss":3119,"sn":3120,"sp":3121,"sa":3122,"sit":3123,"san":3124,"sing":3125,"smar":3126,"sent":3127,"squ":3128,"session":3129,"samples":3130,"sped":3131,"space":3132,"saf":3133,"side":3134,"sampler":3135,"silu":3136,"says":3137,"sending":3138,"tb":3139,"tar":3140,"tas":3141,"tun":3142,"tem":3143,"t_co":3144,"ur":3145,"ub":3146,"ups":3147,"uriegas":3148,"vk":3149,"vis":3150,"viz":3151,"vvi":3152,"wr":3153,"ww":3154,"wort":3155,"wid":3156,"watch":3157,"wave":3158,"xr":3159,"xd":3160,"yam":3161,"yol":3162,"zou":3163,"}\"":3164,"}`":3165,"##res":3166,"##rant":3167,"##rue":3168,"##ress":3169,"##ray":3170,"##rpc":3171,"##rese":3172,"##ression":3173,"##rtc":3174,"##rins":3175,"##rained":3176,"##o5":3177,"##of":3178,"##oing":3179,"##ole":3180,"##ove":3181,"##oth":3182,"##oice":3183,"##optim":3184,"##o_shape":3185,"##cy":3186,"##c3":3187,"##c4":3188,"##ca":3189,"##c1":3190,"##cf":3191,"##cum":3192,"##core":3193,"##case":3194,"##c24":3195,"##c87":3196,"##come":3197,"##c68":3198,"##clud":3199,"##ca1":3200,"##c59":3201,"##c1d":3202,"##caa":3203,"##c5f":3204,"##catter":3205,"##ew":3206,"##e1":3207,"##e6":3208,"##e0":3209,"##eed":3210,"##equ":3211,"##eig":3212,"##e_f":3213,"##e55":3214,"##e42":3215,"##e58":3216,"##eving":3217,"##event":3218,"##eier":3219,"##elet":3220,"##e5d":3221,"##e_cache":3222,"##sed":3223,"##sum":3224,"##sent":3225,"##sort":3226,"##sue":3227,"##sour":3228,"##s_test":3229,"##s_s":3230,"##single":3231,"##sistent":3232,"##ire":3233,"##ips":3234,"##idd":3235,"##iate":3236,"##iable":3237,"##ique":3238,"##nt":3239,"##nl":3240,"##ner":3241,"##nou":3242,"##neg":3243,"##n_output":3244,"##numerics":3245,"##gen":3246,"##get":3247,"##gist":3248,"##gth":3249,"##gine":3250,"##grou":3251,"##gather":3252,"##gative":3253,"##ted":3254,"##test":3255,"##tum":3256,"##tle":3257,"##tup":3258,"##tob":3259,"##tain":3260,"##ties":3261,"##text":3262,"##tream":3263,"##tivation":3264,"##tire":3265,"##hen":3266,"##hat":3267,"##hol":3268,"##hens":3269,"##handl":3270,"##hind":3271,"##hors":3272,"##uf":3273,"##uit":3274,"##uation":3275,"##use":3276,"##uous":3277,"##uated":3278,"##uzo":3279,"##uching":3280,"##uiltins":3281,"##uriegas":3282,"##b0":3283,"##bar":3284,"##bed":3285,"##bit":3286,"##bod":3287,"##bel":3288,"##benchmark":3289,"##band":3290,"##b80":3291,"##bot":3292,"##bea":3293,"##b19":3294,"##bias":3295,"##bian":3296,"##b350":3297,"##bind":3298,"##b15":3299,"##bale":3300,"##binomial":3301,"##_j":3302,"##_an":3303,"##_ut":3304,"##_as":3305,"##_et":3306,"##_ac":3307,"##_per":3308,"##_stack":3309,"##_quantize":3310,"##_40":3311,"##_param":3312,"##_path":3313,"##_appro":3314,"##_operator":3315,"##_event":3316,"##pa":3317,"##pet":3318,"##pol":3319,"##pad":3320,"##pip":3321,"##pul":3322,"##p16":3323,"##pond":3324,"##pep":3325,"##pite":3326,"##pir":3327,"##pick":3328,"##pi_":3329,"##yan":3330,"##yeager":3331,"##y_init":3332,"##y_promot":3333,"##ynam":3334,"##y_cache":3335,"##ler":3336,"##lic":3337,"##less":3338,"##lul":3339,"##loo":3340,"##load":3341,"##lice":3342,"##lier":3343,"##lict":3344,"##lta":3345,"##lieve":3346,"##linter":3347,"##lcome":3348,"##wc":3349,"##wd":3350,"##warn":3351,"##what":3352,"##54":3353,"##598":3354,"##580":3355,"##584":3356,"##542":3357,"##540":3358,"##5e7":3359,"##5e55":3360,"##398":3361,"##360":3362,"##399":3363,"##311":3364,"##351":3365,"##3c7":3366,"##3_st":3367,"##3936":3368,"##45":3369,"##41":3370,"##4e2":3371,"##416":3372,"##456":3373,"##424":3374,"##460":3375,"##4_h":3376,"##440":3377,"##4264":3378,"##vor":3379,"##vrtc":3380,"##me":3381,"##med":3382,"##mit":3383,"##mal":3384,"##met":3385,"##mul":3386,"##mid":3387,"##more":3388,"##mend":3389,"##m_benchmark":3390,"##mems":3391,"##a8":3392,"##az":3393,"##aac":3394,"##aff":3395,"##aint":3396,"##a13":3397,"##a18":3398,"##aite":3399,"##air":3400,"##a42":3401,"##aves":3402,"##avis":3403,"##a48":3404,"##a513":3405,"##a6e":3406,"##dog":3407,"##d10":3408,"##d89":3409,"##dbb":3410,"##d813":3411,"##916":3412,"##990":3413,"##850":3414,"##8_d":3415,"##853":3416,"##817":3417,"##864":3418,"##8a3":3419,"##8982":3420,"##863":3421,"##8f3":3422,"##250":3423,"##253":3424,"##293":3425,"##2a1":3426,"##2caa":3427,"##25e7":3428,"##2aac":3429,"##zv":3430,"##zol":3431,"##198":3432,"##127":3433,"##117":3434,"##1e7":3435,"##1509":3436,"##66":3437,"##653":3438,"##694":3439,"##638":3440,"##7e2":3441,"##720":3442,"##710":3443,"##764":3444,"##794":3445,"##737":3446,"##797f":3447,"##74e2":3448,"##7d813":3449,"##04":3450,"##00":3451,"##0ff":3452,"##0ab":3453,"##016":3454,"##096":3455,"##042":3456,"##062":3457,"##0fd":3458,"##056e":3459,"##0360":3460,"##0a6e":3461,"##ft":3462,"##fet":3463,"##full":3464,"##ful":3465,"##f18":3466,"##f93":3467,"##f31":3468,"##fix":3469,"##f34":3470,"##f6e":3471,"##functions":3472,"##f688":3473,"##fair":3474,"##f7e2":3475,"##xim":3476,"##ked":3477,"##)\"":3478,"##jor":3479,"##orr":3480,"##oredund":3481,"##esis":3482,"##esent":3483,"##ery":3484,"##erved":3485,"##er_b":3486,"##ernel":3487,"##erdatapipe":3488,"##ercis":3489,"##ini":3490,"##ines":3491,"##init":3492,"##ination":3493,"##inct":3494,"##instance":3495,"##inuous":3496,"thre":3497,"thread":3498,"think":3499,"##aring":3500,"##arant":3501,"##arange":3502,"##arge":3503,"##areness":3504,"##only":3505,"##on_ut":3506,"##enan":3507,"##enation":3508,"##engg":3509,"##en_encoder":3510,"##ata":3511,"##athon":3512,"##ativ":3513,"##ataset":3514,"##atures":3515,"##atapipe":3516,"##atforms":3517,"##chs":3518,"##ched":3519,"##chbl":3520,"##edan":3521,"##edum":3522,"##ed_s":3523,"##ed_grad":3524,"##edict":3525,"##ed78":3526,"##ed_encoder":3527,"##edoing":3528,"##edtup":3529,"##ested":3530,"##est_list":3531,"##est_path":3532,"ing":3533,"inter":3534,"inex":3535,"in_c":3536,"inser":3537,"in_f":3538,"instr":3539,"incon":3540,"inform":3541,"info":3542,"infos":3543,"inappro":3544,"inverse":3545,"##itation":3546,"##itize":3547,"##itable":3548,"##item":3549,"##ities":3550,"##itzo":3551,"##itted":3552,"pybind":3553,"pypa":3554,"thean":3555,"##anld":3556,"##anipulation":3557,"##ancy":3558,"##any_promot":3559,"##umed":3560,"##um_t":3561,"##umulation":3562,"##umstance":3563,"##umably":3564,"##ingup":3565,"##ingerror":3566,"token":3567,"touching":3568,"testcase":3569,"##als":3570,"##alent":3571,"##al_l":3572,"##alified":3573,"##alibration":3574,"##ionary":3575,"##utex":3576,"##lee":3577,"##lead":3578,"##lection":3579,"##le_r":3580,"##lete":3581,"##leaf":3582,"##leci":3583,"reent":3584,"reply":3585,"comes":3586,"compl":3587,"comple":3588,"compar":3589,"isn":3590,"is_tensor":3591,"isinstance":3592,"##lli":3593,"##llates":3594,"##ods":3595,"##ash":3596,"##asing":3597,"##ety":3598,"##etype":3599,"##etect":3600,"##eturn":3601,"##etrained":3602,"##ithm":3603,"forked":3604,"##aceness":3605,"filed":3606,"##rees":3607,"##regg":3608,"##reference":3609,"##regist":3610,"##rehens":3611,"##reme":3612,"##unter":3613,"##un_j":3614,"##ttom":3615,"##ttrue":3616,"annot":3617,"anomaly":3618,"##ammar":3619,"##ecore":3620,"##ece5d":3621,"##ecalibration":3622,"##imin":3623,"##ubmit":3624,"##ddp":3625,"##dd10":3626,"##dd56e":3627,"##iced":3628,"##icog":3629,"##icult":3630,"##icient":3631,"##ic_handler":3632,"##ort_tr":3633,"##rier":3634,"##riate":3635,"##oling":3636,"##ol_f":3637,"##ollet":3638,"adda":3639,"add_h":3640,"addition":3641,"addbmm":3642,"address":3643,"##port_stack":3644,"##adata":3645,"##ation_r":3646,"##ffer":3647,"##ffine":3648,"##ffix":3649,"behind":3650,"believe":3651,"##veat":3652,"##izers":3653,"##stest":3654,"##stand":3655,"test_ex":3656,"test_pro":3657,"test_ser":3658,"test_tr":3659,"test_run":3660,"test_nam":3661,"test_inter":3662,"test_neg":3663,"test_gather":3664,"test_bar":3665,"test_arange":3666,"test_leaf":3667,"test_reference":3668,"##select":3669,"##search":3670,"##sehol":3671,"##ce4":3672,"##cebl":3673,"##ctorch":3674,"convert":3675,"white":3676,"whole":3677,"##acklinter":3678,"##apis":3679,"##apting":3680,"torch_warn":3681,"##ilar":3682,"##ilities":3683,"##illee":3684,"##angular":3685,"##angregg":3686,