{"version":"1.0","truncation":null,"padding":null,"added_tokens":[{"id":0,"special":true,"content":"[UNK]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":1,"special":true,"content":"[CLS]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":2,"special":true,"content":"[SEP]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":3,"special":true,"content":"[PAD]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":4,"special":true,"content":"[MASK]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false}],"normalizer":{"type":"Sequence","normalizers":[{"type":"NFD"},{"type":"Lowercase"},{"type":"StripAccents"}]},"pre_tokenizer":{"type":"Whitespace"},"post_processor":{"type":"TemplateProcessing","single":[{"SpecialToken":{"id":"[CLS]","type_id":0}},{"Sequence":{"id":"A","type_id":0}},{"SpecialToken":{"id":"[SEP]","type_id":0}}],"pair":[{"SpecialToken":{"id":"[CLS]","type_id":0}},{"Sequence":{"id":"A","type_id":0}},{"SpecialToken":{"id":"[SEP]","type_id":0}},{"Sequence":{"id":"B","type_id":1}},{"SpecialToken":{"id":"[SEP]","type_id":1}}],"special_tokens":{"[CLS]":{"id":"[CLS]","ids":[1],"tokens":["[CLS]"]},"[SEP]":{"id":"[SEP]","ids":[2],"tokens":["[SEP]"]}}},"decoder":null,"model":{"type":"WordPiece","unk_token":"[UNK]","continuing_subword_prefix":"##","max_input_chars_per_word":100,"vocab":{"[UNK]":0,"[CLS]":1,"[SEP]":2,"[PAD]":3,"[MASK]":4,"!":5,"\"":6,"#":7,"$":8,"%":9,"&":10,"'":11,"(":12,")":13,"*":14,"+":15,",":16,"-":17,".":18,"/":19,"0":20,"1":21,"2":22,"3":23,"4":24,"5":25,"6":26,"7":27,"8":28,"9":29,":":30,";":31,"<":32,"=":33,">":34,"?":35,"@":36,"[":37,"\\":38,"]":39,"^":40,"_":41,"`":42,"a":43,"b":44,"c":45,"d":46,"e":47,"f":48,"g":49,"h":50,"i":51,"j":52,"k":53,"l":54,"m":55,"n":56,"o":57,"p":58,"q":59,"r":60,"s":61,"t":62,"u":63,"v":64,"w":65,"x":66,"y":67,"z":68,"{":69,"|":70,"}":71,"~":72,"##l":73,"##d":74,"##_":75,"##m":76,"##o":77,"##u":78,"##e":79,"##a":80,"##p":81,"##\"":82,"##:":83,"##s":84,"##i":85,"##r":86,"##t":87,"##z":88,"##c":89,"##k":90,"##g":91,"##n":92,"##w":93,"##0":94,"##b":95,"##h":96,"##q":97,"##f":98,"##5":99,"##(":100,"##'":101,"##v":102,"##[":103,"##y":104,"##,":105,"##2":106,"##j":107,"##)":108,"##;":109,"##`":110,"##.":111,"##x":112,"##7":113,"##4":114,"##3":115,"##1":116,"##-":117,"##6":118,"##]":119,"##\\":120,"##$":121,"##{":122,"##}":123,"##^":124,"##>":125,"##+":126,"##9":127,"##8":128,"##/":129,"##*":130,"##!":131,"##<":132,"##@":133,"##=":134,"###":135,"##%":136,"##|":137,"##~":138,"##or":139,"##er":140,"##at":141,"##es":142,"##on":143,"##in":144,"##en":145,"##el":146,"##ch":147,"##ut":148,"##et":149,"##ar":150,"##al":151,"in":152,"de":153,"##le":154,"##an":155,"##elf":156,"self":157,"##ed":158,"##od":159,"##as":160,"##orch":161,"##pe":162,"##ion":163,"##ce":164,"th":165,"##t_":166,"torch":167,"):":168,"##am":169,"##put":170,"##ad":171,"##ro":172,"def":173,"##st":174,"##ing":175,"##iz":176,"##ty":177,"the":178,"##e_":179,"##ens":180,"##ct":181,"##tr":182,"##im":183,"##lo":184,"##it":185,"##mp":186,"##se":187,"##un":188,"##re":189,"##ue":190,"tes":191,"##ul":192,"##ck":193,"##vi":194,"##ensor":195,"()":196,"##_d":197,"##ur":198,"is":199,"op":200,"##ent":201,"##_s":202,"##ser":203,"for":204,"##ip":205,"##type":206,"##ort":207,"##ot":208,"##il":209,"input":210,"mod":211,"##ig":212,"devi":213,"as":214,"if":215,"##rad":216,"tr":217,"##um":218,"##ize":219,"',":220,"##ass":221,"##_m":222,"##and":223,"device":224,"tensor":225,"cl":226,"ret":227,"##_n":228,"##_in":229,"##ist":230,"st":231,"##ule":232,"##urn":233,"imp":234,"class":235,"return":236,"##id":237,"##ap":238,"##gs":239,"##ex":240,"##_p":241,"##ation":242,"##up":243,"import":244,"##ame":245,"test":246,"))":247,"re":248,"##qu":249,"##ol":250,"),":251,"ar":252,"##rom":253,"##ud":254,"con":255,"to":256,"('":257,"of":258,"##is":259,"non":260,"an":261,"##_c":262,"##ter":263,"##om":264,"],":265,"ex":266,"out":267,"asser":268,"lo":269,"##if":270,"dtype":271,"##op":272,"##atch":273,"##_f":274,"##ult":275,"##ic":276,"sh":277,"##ace":278,"true":279,"str":280,"none":281,"##_t":282,"int":283,"not":284,"##ble":285,"##ath":286,"##ver":287,"##loat":288,"from":289,"##ith":290,"##grad":291,"##aram":292,"test_":293,"##eck":294,"##kip":295,"##ff":296,"##ag":297,"assert":298,"##th":299,"##uda":300,"skip":301,"##_b":302,"##alse":303,"dim":304,"##ard":305,"##_size":306,"##ant":307,"##),":308,"##igh":309,"false":310,"##ers":311,"(\"":312,"##ction":313,"and":314,"at":315,"ch":316,"defa":317,"##ack":318,"##ate":319,"##est":320,"##eigh":321,"``":322,"##arg":323,"##pes":324,"float":325,"##ata":326,"args":327,"##types":328,"##ay":329,"##tim":330,"##ase":331,"##\"\"":332,"model":333,"##ib":334,"get":335,"on":336,"##rap":337,"##con":338,"##odule":339,"output":340,":`":341,"##ment":342,"##iv":343,"fun":344,"grad":345,"sc":346,"##ode":347,"val":348,"##able":349,"##ir":350,"##add":351,"default":352,"##_l":353,"be":354,"module":355,"##out":356,"ty":357,"##sp":358,"##00":359,"##ape":360,"with":361,"##pl":362,"##ess":363,"##eight":364,"or":365,"\",":366,"##pu":367,"##ork":368,"##all":369,"bu":370,"##equ":371,"check":372,"##ext":373,"param":374,"##nel":375,"al":376,"un":377,"##ator":378,"\"\"\"":379,"##ss":380,"##lob":381,"##fo":382,"##ple":383,"##ile":384,"##raph":385,"##em":386,"##ain":387,"##_h":388,"\")":389,"ad":390,"##end":391,"list":392,"nn":393,"##ias":394,"##],":395,"##adding":396,"batch":397,"wh":398,"##rip":399,"##roc":400,"##_input":401,"type":402,"rand":403,"el":404,"##fig":405,"num":406,"py":407,"##ror":408,"qu":409,"##it_":410,"##tion":411,"##ict":412,"##_grad":413,"##equal":414,"([":415,"add":416,"##ample":417,"##ero":418,").":419,"ob":420,"##_w":421,"targ":422,"target":423,"==":424,"####":425,"cuda":426,"##ool":427,"##ide":428,"assertequal":429,"res":430,"run":431,"##_r":432,"attr":433,"en":434,"##_name":435,"padding":436,"##ou":437,"##orm":438,"##args":439,"=[":440,"ma":441,"##cl":442,"##ript":443,"')":444,"co":445,"])":446,"##test":447,"weight":448,"##ension":449,"quant":450,"name":451,"se":452,"work":453,"##av":454,"conv":455,"len":456,"np":457,"##info":458,"_c":459,"##error":460,"##ank":461,"##uple":462,"##config":463,"##_g":464,"##ach":465,"##ial":466,"##case":467,"shape":468,"value":469,"':":470,"((":471,"zero":472,"##int":473,"##val":474,"##edu":475,"##ill":476,"stride":477,"##port":478,"##_out":479,"##roup":480,"##timiz":481,"function":482,"##ub":483,"pro":484,"##dex":485,"else":486,"bias":487,"math":488,"##ari":489,"ker":490,"ne":491,"##age":492,"kernel":493,"com":494,"data":495,"##ly":496,"##eth":497,"##ine":498,"##ast":499,"##_de":500,"node":501,"size":502,"##pec":503,"pr":504,"##per":505,"##ow":506,"set":507,"##module":508,"##aff":509,"(),":510,"option":511,"##_module":512,"testcase":513,"##rocess":514,"group":515,"##_op":516,"this":517,"quantiz":518,"##ps":519,"##ward":520,"##ore":521,"['":522,"iter":523,"##dp":524,"##torch":525,"##co":526,"##space":527,"all":528,"##_lo":529,"##ibut":530,"sample":531,"##par":532,"scal":533,"each":534,"pre":535,"##erator":536,"arg":537,"##ate_":538,"##ect":539,"skipc":540,"dist":541,"##ance":542,"##odel":543,"log":544,"shard":545,"dtypes":546,"tuple":547,"##pp":548,"##cal":549,"##cket":550,"##ument":551,"are":552,"caff":553,"ke":554,"##ult_":555,"##_init_":556,"lay":557,"##e2":558,"##gth":559,"form":560,"it":561,"##tern":562,"())":563,"##_tensor":564,"::":565,"net":566,"path":567,"##16":568,"##check":569,"workspace":570,"##ench":571,"by":572,"graph":573,"##ix":574,"inputs":575,"requ":576,"##place":577,"numb":578,"=(":579,"##_data":580,"##ethod":581,"caffe2":582,"sup":583,"##der":584,"optional":585,"##ep":586,"##cor":587,"##arn":588,"##_co":589,"='":590,"qconfig":591,"##ac":592,"##ary":593,"state":594,"##_output":595,"##_re":596,"##ging":597,"func":598,"layer":599,"optimiz":600,"number":601,"min":602,"redu":603,"##',":604,"##ang":605,"cont":606,"sy":607,"##oo":608,"##ient":609,"##ize_":610,"dimension":611,"##_st":612,"##ated":613,"loss":614,"##_inputs":615,"10":616,"##ames":617,"##_log":618,"format":619,"requir":620,"os":621,"text":622,"us":623,"##cript":624,"##lement":625,"##pect":626,"obser":627,"kw":628,"##2d":629,"##**":630,"bucket":631,"##_con":632,"pytorch":633,"max":634,"**":635,"so":636,"##_type":637,"##os":638,"##ise":639,"call":640,"##_o":641,"##ject":642,"##ory":643,"unit":644,"##ializ":645,">>":646,"no":647,"##ribut":648,"that":649,"##_dim":650,">>>":651,"']":652,"bool":653,"mas":654,"##nn":655,"##hape":656,"##ved":657,"##tra":658,"train":659,"##andl":660,"##thon":661,"requires":662,"__init_":663,"do":664,"##den":665,"##emp":666,"##set":667,"##32":668,"##idden":669,")),":670,"######":671,"__init__":672,"bro":673,"pl":674,"{}":675,"##fer":676,"##annel":677,"kwargs":678,"##tensor":679,"inst":680,"par":681,"##ma":682,"##que":683,"##low":684,"object":685,"ra":686,"##__":687,"##process":688,"##net":689,"load":690,"distribut":691,"cre":692,"hidden":693,"rank":694,"##gn":695,"##udaif":696,"##ouble":697,"skipcudaif":698,"unittest":699,"requires_grad":700,"can":701,"dict":702,"ign":703,"##blob":704,"##ode_":705,"expect":706,"jit":707,"##dic":708,"##ues":709,"##uff":710,"##ke":711,"##est_":712,"##ctiv":713,"##_logging":714,"core":715,"vari":716,"##dim":717,"##ark":718,"python":719,"##_and":720,"##inst":721,"##ther":722,"##_len":723,"##000":724,"##dexing":725,"_s":726,"other":727,"will":728,"##eg":729,"##chem":730,")))":731,"##ave":732,"##dp_logging":733,"##dp_logging_data":734,"dat":735,"element":736,"##ere":737,"##ans":738,"##ules":739,"##_dict":740,"stat":741,"##clud":742,"expected":743,"app":744,"we":745,"##us":746,"##adc":747,"##unc":748,"##inear":749,"sample_inputs":750,"##instance":751,"di":752,"size_":753,"##ab":754,"##ind":755,"exp":756,"##time":757,"script":758,"new":759,"comm":760,"place":761,"raise":762,"cpu":763,"fil":764,"sum":765,"##mark":766,"##fa":767,"##uld":768,"opinfo":769,"##romot":770,"##verage":771,"##chema":772,"##_ch":773,"##gist":774,"##e__":775,"().":776,"##old":777,"##enchmark":778,"##ange":779,"##dices":780,"[[":781,"gen":782,"##_tr":783,"##_types":784,"##ob":785,"##average":786,"ones":787,"comp":788,"append":789,"##ead":790,"##iter":791,"##unction":792,"observed":793,"]]":794,"ac":795,"tim":796,"use":797,"##ose":798,"##ez":799,"##ew":800,"##ces":801,"##form":802,"():":803,"##opy":804,"buff":805,"random":806,"##_graph":807,"##_channel":808,"12":809,"over":810,"schema":811,"##file":812,"isinstance":813,"skipif":814,"when":815,"##rocm":816,"scalar":817,"optimizer":818,"##base":819,"init":820,"##str":821,"##rect":822,"any":823,"integ":824,"result":825,"groups":826,"size_average":827,"back":828,"eps":829,"##ong":830,"##ence":831,"##ansp":832,"##true":833,"##ild":834,"skipinfo":835,"reduce":836,"activ":837,"##spec":838,"##inal":839,"##elu":840,"##e_f":841,"##_map":842,"key":843,"##andler":844,"broadc":845,"ignor":846,"variable":847,"]',":848,"##bias":849,"only":850,"paramet":851,"kernel_size":852,"argument":853,"support":854,"##_length":855,"'),":856,"..":857,"fc":858,"pack":859,"spec":860,"warn":861,"##model":862,"##ould":863,"dep":864,"##ingle":865,"operator":866,"##ilation":867,"see":868,"->":869,"]),":870,"},":871,"##_val":872,"##pack":873,"##float":874,"##yn":875,"##3d":876,"##{}":877,"##eta":878,"##lex":879,"##aset":880,"##sec":881,"##_model":882,"##_param":883,"##ive":884,"##ients":885,"cur":886,"sub":887,"##dat":888,"##_a":889,"##param":890,"##sion":891,"##tt":892,"##andle":893,"##_indexing":894,"##ist_":895,"example":896,"local":897,"##_blob":898,"distributed":899,"placement":900,"fe":901,"##de":902,"##ump":903,"##attern":904,"##enc":905,"decor":906,"##_shape":907,"forward":908,"asserttrue":909,"##avg":910,"##cope":911,"keep":912,"_g":913,"er":914,"##ied":915,"inplace":916,"ref":917,"consec":918,"should":919,"##_test":920,"grad_output":921,"where":922,"##_defa":923,"htt":924,"pad":925,"##ds":926,"##_id":927,"##_arg":928,"##pc":929,"##tx":930,"##bu":931,"##))":932,"##ils":933,"std":934,"##quant":935,"##ibatch":936,"##_rank":937,"minibatch":938,"##_cont":939,":/":940,"=\"":941,"ctx":942,"dilation":943,"gith":944,"linear":945,"##ant_":946,"##ast_":947,"##_buff":948,"##eight_":949,"check_indexing":950,"##ook":951,"##ost_":952,"instead":953,"://":954,"github":955,"copy":956,"fl":957,"has":958,"mat":959,"##pr":960,"##--":961,"##alf":962,"##vice":963,"modules":964,"devices":965,"returns":966,"##ations":967,"('[":968,"values":969,"##ialization":970,"mask":971,"##romotion":972,"##gister":973,"https":974,"].":975,"__f":976,"file":977,"##ke_":978,"##one":979,"iss":980,"device_type":981,"qconfig_dict":982,"training":983,"integers":984,"activation":985,"decorator":986,"##_default_":987,"'],":988,"]],":989,"blob":990,"gpu":991,"half":992,"})":993,"##ress":994,"##name":995,"##_dtypes":996,"star":997,"batch_size":998,"##ous":999,"length":1000,"##_channels":1001,"specif":1002,")`":1003,"_f":1004,"have":1005,"##dtype":1006,"##_i":1007,"##se_":1008,"##script":1009,"##ies":1010,"##iel":1011,"##ich":1012,"##to":1013,"##no":1014,"##input":1015,"##ent_":1016,"##etch":1017,"##rop":1018,"##stant":1019,"rem":1020,"which":1021,"need":1022,"##_comp":1023,"used":1024,"time":1025,"##rectory":1026,"_get":1027,"100":1028,"giv":1029,"mu":1030,"##uct":1031,"##cep":1032,"##urce":1033,"##andal":1034,"##_to":1035,"default_":1036,"gradcheck":1037,"##extension":1038,"randn":1039,"quantized":1040,"does":1041,"##umpy":1042,"given":1043,"0000":1044,"[]":1045,"aut":1046,"le":1047,"range":1048,"rpc":1049,"##\")":1050,"##test_":1051,"##ft":1052,"##77":1053,"then":1054,"##ull":1055,"##ures":1056,"##oth":1057,"##iffer":1058,":`(":1059,"super":1060,"##****":1061,"gener":1062,"decorators":1063,"][":1064,"ddp_logging_data":1065,"fetch":1066,"method":1067,"same":1068,"##path":1069,"##nom":1070,"##elper":1071,"##ross":1072,"tensors":1073,"##_nam":1074,"runtime":1075,"scale":1076,"graph_module":1077,"##_types_and":1078,"##inalg":1079,"##_default_dtype":1080,",),":1081,"long":1082,"numpy":1083,"##_z":1084,"##oint":1085,"##com":1086,"##names":1087,"##utur":1088,"##otal":1089,"##upport":1090,"##ises":1091,"##verag":1092,"att":1093,"elif":1094,"##_device":1095,"##traises":1096,"##sets":1097,"##indow":1098,"curr":1099,"keepdim":1100,"__futur":1101,"##ifferent":1102,"__future__":1103,"av":1104,"averag":1105,"match":1106,"ser":1107,"ut":1108,"##ld":1109,"##_args":1110,"##_extension":1111,"##ograd":1112,"##rit":1113,"##rix":1114,"##ced":1115,"##fn":1116,"##)),":1117,"##ell":1118,"indices":1119,"register":1120,"assertraises":1121,"aten":1122,"build":1123,"params":1124,"##_gradgrad":1125,"##int8":1126,"##########":1127,"buffer":1128,"##_lengths":1129,"error":1130,"double":1131,"mom":1132,"per":1133,"single":1134,"##ure":1135,"##pool":1136,"##1d":1137,"##ates":1138,"init_":1139,"##_db":1140,"op_b":1141,"op_db":1142,"##ention":1143,"input_size":1144,"##_info":1145,"##_padding":1146,"##_post_":1147,"##_func":1148,"iterable":1149,"prepar":1150,"skipcudaifrocm":1151,"##ansform":1152,"##anspose":1153,"##e_fx":1154,"depend":1155,"fetchblob":1156,"op_bench":1157,"##_post_process":1158,"`,":1159,"gc":1160,"temp":1161,"vers":1162,"weight_":1163,"##da":1164,"##_v":1165,"##med":1166,"##cum":1167,"##bda":1168,"##ampl":1169,"##ambda":1170,"##loss":1171,"##_set":1172,"##api":1173,"##_path":1174,"##_point":1175,"##_cl":1176,"##_for":1177,"##puif":1178,"##ally":1179,"##_res":1180,"##clar":1181,"functional":1182,"quantization":1183,"skipcpuif":1184,"divi":1185,"##ield":1186,"version":1187,"1e":1188,"emp":1189,"h_":1190,"lr":1191,"pattern":1192,"relu":1193,"sig":1194,"##ll":1195,"##mod":1196,"##oin":1197,"##ity":1198,"##ron":1199,"##cis":1200,"##nol":1201,"##bs":1202,"##e_s":1203,"trac":1204,"##_method":1205,"##apack":1206,"##_file":1207,"##agma":1208,"``,":1209,"coun":1210,"weights":1211,"contain":1212,"callable":1213,"master":1214,"skipcudaifnom":1215,"common":1216,"feat":1217,"##ency":1218,"autograd":1219,"runtimeerror":1220,"skipcpuifnol":1221,"##cision":1222,"skipcudaifnomagma":1223,"skipcpuifnolapack":1224,"\"]":1225,"_b":1226,"fir":1227,"lib":1228,"process":1229,"{'":1230,"##ean":1231,"##ha":1232,"##ort_":1233,"##ename":1234,"##als":1235,"##ings":1236,"##umer":1237,"constant":1238,"##version":1239,"##gradients":1240,"float16":1241,"##_list":1242,"##endez":1243,"##educe":1244,"##timizer":1245,"##_ops":1246,"losses":1247,"##_off":1248,"##max":1249,"##_buffer":1250,"activation_post_process":1251,"##indows":1252,"moment":1253,"empty":1254,"##endezv":1255,"\":":1256,"@@":1257,"`.":1258,"id":1259,"join":1260,"lambda":1261,"mult":1262,"w_":1263,"##\",":1264,"##cuda":1265,"##hard":1266,"##ype":1267,"##64":1268,"##ord":1269,"##attr":1270,"##one_":1271,"##lean":1272,"##its":1273,"##server":1274,"##_mode":1275,"##_net":1276,"##_py":1277,"##_fn":1278,"float32":1279,"##ript_":1280,"make_":1281,"hidden_size":1282,"##_offsets":1283,".,":1284,":]":1285,"[\"":1286,"_p":1287,"bfloat":1288,"cud":1289,"total":1290,"up":1291,"##dict":1292,"##ope":1293,"##ping":1294,"##gd":1295,"##qconfig":1296,"declar":1297,"##_dtype":1298,"optim":1299,"##_norm":1300,"testing":1301,"extra":1302,"skips":1303,"##conv":1304,"scope":1305,"]):":1306,"seq":1307,"##comp":1308,"sym":1309,"##ference":1310,"128":1311,"broadcast":1312,"##ync":1313,"start":1314,"##andalone_":1315,"momentum":1316,"bfloat16":1317,"20":1318,"ce":1319,"may":1320,"ro":1321,"sequ":1322,"ver":1323,"##_on":1324,"##_ex":1325,"##_iter":1326,"##_avg":1327,"##irectory":1328,"##tes":1329,"##graph":1330,"##work":1331,"##ative":1332,"##env":1333,"includ":1334,"##odes":1335,"##imple":1336,"open":1337,"##sert_":1338,"##_node_":1339,"##_test_":1340,"outputs":1341,"item":1342,"##ternal":1343,"sys":1344,"##observer":1345,"backward":1346,"parameter":1347,"##_complex":1348,"##upported":1349,"averaged":1350,"##amples":1351,"containing":1352,"first":1353,"ceil":1354,"cross":1355,"fn":1356,"linalg":1357,"man":1358,"nam":1359,"rendezv":1360,"spl":1361,"tod":1362,"##ax":1363,"##ags":1364,"##pha":1365,"##benchmark":1366,"##yp":1367,"##_mat":1368,"##_min":1369,"##_names":1370,"testgradients":1371,"##olut":1372,"##argument":1373,"unbias":1374,"##emory":1375,"valueerror":1376,"proto":1377,"precision":1378,"##_ref":1379,"##queue":1380,"##key":1381,"stats":1382,"filter":1383,"observed_graph":1384,"attention":1385,"##apipe":1386,"todo":1387,"unbiased":1388,"\".":1389,"_test_":1390,"ap":1391,"dt":1392,"den":1393,"eval":1394,"rnn":1395,"##_un":1396,"##ec":1397,"##aun":1398,"##po":1399,"##promotion":1400,"##\".":1401,"##res":1402,"##ken":1403,"##func":1404,"##ink":1405,"##elp":1406,"##eters":1407,"index":1408,"##rol":1409,"orig":1410,"print":1411,"source":1412,"create_":1413,"##_trace":1414,"##othes":1415,"##_zero":1416,"root":1417,"##ypothes":1418,"##aunch":1419,"!=":1420,"drop":1421,"different":1422,"ev":1423,"glob":1424,"slow":1425,"zip":1426,"##lic":1427,"##min":1428,"##ail":1429,"##ta":1430,"##ten":1431,"##gex":1432,"##01":1433,"##99":1434,"##e_in":1435,"##ref":1436,"##idth":1437,"##isc":1438,"##ome":1439,"excep":1440,"##ops":1441,"##_function":1442,"##allel":1443,"alpha":1444,"##_weight":1445,"env":1446,"##placement":1447,"create":1448,"sample_inputs_func":1449,"issue":1450,"##rite":1451,"mayb":1452,"ceil_mode":1453,"named":1454,"##_matrix":1455,"\"],":1456,"cal":1457,"des":1458,"fx":1459,"fout":1460,"hu":1461,"pass":1462,"var":1463,"}}":1464,"##md":1465,"##ov":1466,"##gen":1467,"##gine":1468,"##qa":1469,"##vari":1470,"##73":1471,"##etr":1472,"##_double":1473,"##_ddp_logging_data":1474,"##_directory":1475,"is_w":1476,"##_scal":1477,"##typepromotion":1478,"cls":1479,"testtypepromotion":1480,"##ics":1481,"test_fn":1482,"##_batch":1483,"floating":1484,"float_double":1485,"##irs":1486,"conv2d":1487,"zero_point":1488,"##_opt":1489,"iteration":1490,"sampleinput":1491,"dtypesif":1492,"noqa":1493,"##queez":1494,"summed":1495,"##dataset":1496,"##params":1497,"features":1498,"float_double_default_dtype":1499,"ax":1500,"but":1501,"benchmark":1502,"beta":1503,"nc":1504,"##late":1505,"##_qu":1506,"##rt":1507,"##ner":1508,"##with":1509,"##elta":1510,"##ed_module":1511,"##t_in":1512,"##repack":1513,"ops":1514,"##ility":1515,"##_indices":1516,"assert_":1517,"##_tuple":1518,"test_s":1519,"one":1520,"##plic":1521,"##_hook":1522,"##_work":1523,"attribut":1524,"##cord":1525,"syn":1526,"parser":1527,"dataset":1528,"##clude_":1529,"observed_node_":1530,"broadcast_":1531,"parameters":1532,"##bug":1533,"##quantize":1534,"##names_set":1535,"##cumul":1536,"test_fn_gradgrad":1537,"nccl":1538,"observed_node_names_set":1539,"\"),":1540,"_in":1541,"bn":1542,"code":1543,"hip":1544,"height":1545,"hypothes":1546,"ms":1547,"mul":1548,"que":1549,"spar":1550,"save":1551,"width":1552,"##method":1553,"##ost":1554,"##oid":1555,"##ray":1556,"##reduce":1557,"##cay":1558,"##handler":1559,"##fin":1560,"##function":1561,"##xy":1562,"##orary":1563,"##orld":1564,"##inator":1565,"debug":1566,"##ason":1567,"mode":1568,"device_id":1569,"##optimizer":1570,"struct":1571,"##cond":1572,"gradient":1573,"order":1574,"##_handler":1575,"second":1576,"zero_de":1577,"##ether":1578,"['[":1579,"shard_offsets":1580,"##derr":1581,"ignores":1582,"local_rank":1583,"##ression":1584,"must":1585,"utils":1586,"##andalone_module":1587,"namedt":1588,"##queeze":1589,"zero_debias":1590,"999":1591,"]:":1592,"__nam":1593,"bs":1594,"cpp":1595,"ddp":1596,"disc":1597,"mess":1598,"node_":1599,"##uss":1600,"##ufunc":1601,"##eam":1602,"##ak":1603,"##pad":1604,"##size":1605,"##ick":1606,"##not":1607,"##b2":1608,"##back":1609,"##}],":1610,"in_channels":1611,"##oder":1612,"##ized":1613,"##und":1614,"##_script":1615,"##_sync":1616,"##_new":1617,"step":1618,"##_per":1619,"##_prepack":1620,"repo":1621,"ext":1622,"get_":1623,"##cont":1624,"##spar":1625,"##_handle":1626,"nnq":1627,"run_test":1628,"quantize_":1629,"all_types_and":1630,"##_init_net":1631,"dimensions":1632,"##_of":1633,"##ialized":1634,"broken":1635,"distribution":1636,"elements":1637,"buffers":1638,"packag":1639,"##_context":1640,"flat":1641,"##ftmax":1642,"##comment":1643,"cudnn":1644,"items":1645,"rendezvous":1646,"issuecomment":1647,"is_windows":1648,"##_workers":1649,"__name__":1650,"(*":1651,")]":1652,"]\",":1653,"bet":1654,"cand":1655,"foo":1656,"field":1657,"nll":1658,"uint8":1659,"##des":1660,"##mul":1661,"##st_":1662,"##ian":1663,"##')":1664,"##473":1665,"##61":1666,"##stm":1667,"##viron":1668,"##_ddp":1669,"##_max":1670,"tests":1671,")):":1672,"##olle":1673,"out_channels":1674,"loc":1675,"##option":1676,"##operator":1677,"##_fil":1678,"##ager":1679,"##_bu":1680,"output_size":1681,"checkscript":1682,"##figs":1683,"engine":1684,"shard_lengths":1685,"##aryufunc":1686,"layer_data":1687,"##andles":1688,"##abel":1689,"ignored":1690,"warnings":1691,"remot":1692,"dependency":1693,"count_in":1694,"sequence":1695,"device_ids":1696,"message":1697,"candid":1698,"count_include_":1699,"({":1700,".\")":1701,"477":1702,"7473":1703,"_j":1704,"_module":1705,"action":1706,"cor":1707,"mean":1708,"norm":1709,"names":1710,"nodes":1711,"pull":1712,"rh":1713,"vi":1714,"##lags":1715,"##dir":1716,"##_en":1717,"##_se":1718,"##supported":1719,"##norm":1720,"##fix":1721,"##ytes":1722,"##10":1723,"##int_":1724,"##eter":1725,"##etensor":1726,"##ared":1727,"##arallel":1728,"##izes":1729,"##ense":1730,"##regex":1731,"##serialization":1732,"##_pb2":1733,"testspar":1734,"array":1735,"##_cuda":1736,"##_from":1737,"##ical":1738,"note":1739,"##ayers":1740,":`\\":1741,"##mented":1742,"valid":1743,"whether":1744,"##ools":1745,"attrs":1746,"worker":1747,"_cre":1748,"zeros":1749,"##valid":1750,"##1677":1751,"caffe2_pb2":1752,"##_stat":1753,"##emporary":1754,"load_arg":1755,"skipifrocm":1756,"supported":1757,"gradchecks":1758,"avg":1759,"assertraisesregex":1760,"idx":1761,"##ordinator":1762,"split":1763,"##olution":1764,"axis":1765,"namedtemporary":1766,"discuss":1767,"count_include_pad":1768,"47761":1769,"74731677":1770,"testsparse":1771,"namedtemporaryfile":1772,"discussion":1773,"747316775":1774,"+=":1775,"--":1776,"[:":1777,"cu":1778,"cmd":1779,"hook":1780,"label":1781,"t_co":1782,"{{":1783,"##linear":1784,"##_as":1785,"##_ct":1786,"##ux":1787,"##ry":1788,"##top":1789,"##cript_":1790,"##ked":1791,"##nx":1792,"##bol":1793,"##${":1794,"##utils":1795,"##ctu":1796,"##ition":1797,"##unt":1798,"##read":1799,"implement":1800,"##_cpu":1801,"##ict_":1802,"##_th":1803,"int64":1804,"model_ddp":1805,"##_link":1806,"module_name":1807,"typing":1808,"num_l":1809,"seed":1810,"pred":1811,"##cords":1812,"optimization":1813,"##criptor":1814,"filename":1815,"##anspos":1816,"operators":1817,"##_params":1818,"placementspec":1819,"##decay":1820,"##_argument":1821,"devicescope":1822,"specified":1823,"##********":1824,"declaration":1825,"symbol":1826,"##implemented":1827,"##sert_observer":1828,"queue":1829,"ddp_model":1830,"packaging":1831,"rho":1832,"symbolic":1833,"__g":1834,"ast":1835,"bas":1836,"case":1837,"fin":1838,"n_dim":1839,"##les":1840,"##oc":1841,"##ef":1842,"##cd":1843,"##node":1844,"##hold":1845,"##`.":1846,"##inue":1847,"##ely":1848,"##elect":1849,"##are_":1850,"dequantize":1851,"thres":1852,"##reference":1853,"##ilder":1854,"##aparallel":1855,"read":1856,"replic":1857,"examples":1858,"stream":1859,"into":1860,"##verr":1861,"##_bytes":1862,"##ctions":1863,"channel":1864,"once":1865,"##rapper":1866,"output_padding":1867,"grad_tensor":1868,"gradients":1869,"buf":1870,"##_with":1871,"]))":1872,"proxy":1873,"##arity":1874,"prod":1875,"reduced":1876,"continue":1877,"##_configs":1878,"max_buffer":1879,"softmax":1880,"doc":1881,"parse_":1882,"_shard":1883,"static":1884,"##ability":1885,"generator":1886,"##obile":1887,"complex":1888,"backend":1889,"keys":1890,"flag":1891,"##_device_opt":1892,"serialization":1893,"division":1894,"##_pytorch":1895,"##ailable":1896,"##descriptor":1897,"_jit_":1898,"__get":1899,"astype":1900,"threshold":1901,"reduced_grad":1902,"''":1903,"16":1904,"br":1905,"cnn":1906,"clean":1907,"dst_":1908,"ele":1909,"fill":1910,"last":1911,"my":1912,"memory":1913,"sp":1914,"sort_":1915,"squeeze":1916,"tan":1917,"you":1918,"##data":1919,"##uc":1920,"##pro":1921,"##sum":1922,"##ible":1923,"##run":1924,"##cus":1925,"##ning":1926,"##helper":1927,"##fter":1928,"##12":1929,"##orage":1930,"##elem":1931,"info":1932,"##log":1933,"##unsupported":1934,"##iple":1935,"stderr":1936,"##olver":1937,"config":1938,"##ibr":1939,"get_tensor":1940,"##_launch":1941,"numel":1942,"add_argument":1943,"enumer":1944,"make":1945,"##class":1946,"zero_dim":1947,"##per_tensor":1948,"##parse":1949,"##_str":1950,"ignore":1951,"datapipe":1952,"##gistry":1953,"##packed":1954,"##nocus":1955,"learn":1956,"rpc_sync":1957,"##_name_":1958,"##################":1959,"iterabledataset":1960,"##_class":1961,"##_forward":1962,"##_only":1963,"attention_weight":1964,"denied":1965,"global":1966,"dtypesifcuda":1967,"extension":1968,"namescope":1969,"num_layers":1970,"parse_args":1971,"elem":1972,"##nocusolver":1973,",))":1974,"25":1975,"_tr":1976,"_un":1977,"_check":1978,"ab":1979,"abs":1980,"b_h":1981,"cast":1982,"colle":1983,"est":1984,"hat":1985,"how":1986,"help":1987,"map":1988,"ple":1989,"pick":1990,"sm":1991,"s1":1992,"sort":1993,"ur":1994,"write":1995,"##det":1996,"##_old":1997,"##_3d":1998,"##_qconfig":1999,"##_queue":2000,"##act":2001,"##rank":2002,"##way":2003,"##wise":2004,"##handle":2005,"##..":2006,"##xt":2007,"##atter":2008,"##once":2009,"##edblob":2010,"##e_tr":2011,"is_pytorch":2012,"oper":2013,"##ents":2014,"##_so":2015,"##_sh":2016,"##_sub":2017,"try":2018,"##_num":2019,"##_node":2020,"##_pro":2021,"##olv":2022,"top":2023,"exist":2024,"int32":2025,"test_in":2026,"model_name_":2027,"param_init_net":2028,"allow":2029,"quant_":2030,"##_wrapper":2031,"target_g":2032,"running":2033,"covari":2034,"##testbase":2035,"##_gpu":2036,"probs":2037,"comput":2038,"print_":2039,"##ult_type":2040,"context":2041,"loaded":2042,"##_and_complex":2043,"_size":2044,"files":2045,"##_transpose":2046,"times":2047,"supports":2048,"stdout":2049,"##_control":2050,"masked":2051,"issues":2052,"current":2053,"prepare_fx":2054,"tempfile":2055,"sign":2056,"##modules":2057,"activation_post_process_map":2058,"_pre":2059,"upd":2060,"optimize":2061,"exception":2062,"##generator":2063,"floating_and_complex":2064,"flatten":2065,"candidates":2066,"_create_":2067,"get_tensor_input":2068,"estim":2069,"please":2070,"'.":2071,",)":2072,".\"":2073,"]`":2074,"b_i":2075,"ctypes":2076,"f4":2077,"main":2078,"native":2079,"tw":2080,"tmp":2081,"}\\":2082,"##list_":2083,"##ded":2084,"##_al":2085,"##_is":2086,"##_error":2087,"##_key":2088,"##mon":2089,"##mix":2090,"##cur":2091,"##wn":2092,"##fill":2093,"##'.":2094,"##vations":2095,"##):":2096,"##onnx":2097,"##ellow":2098,"intern":2099,"indexing":2100,"##anc":2101,"##eddict":2102,"##transform":2103,"##unaryufunc":2104,"##_sizes":2105,"##_mod":2106,"##_numer":2107,"##_pr":2108,"testonnx":2109,"testunaryufunc":2110,"##_cell":2111,"##opset":2112,"test_reference":2113,"##ight":2114,"##estcase":2115,"models":2116,"output_directory":2117,"grad_co":2118,"valu":2119,"check_batch":2120,"randint":2121,"target_h":2122,"environ":2123,"quantize":2124,"proper":2125,"##_option":2126,"preprocess":2127,"prefix":2128,"shards":2129,"##checks":2130,"##_logits":2131,"using":2132,"observations":2133,"##_ob":2134,"##uffers":2135,"]]]":2136,"accumul":2137,"skipifunsupported":2138,"initial":2139,"...":2140,"subprocess":2141,"##dataparallel":2142,"filepath":2143,"remov":2144,"current_":2145,"manager":2146,"appl":2147,"##licing":2148,"maybe_":2149,"##_quant_":2150,"sync":2151,"sparse_":2152,"quantize_per_tensor":2153,"##_files":2154,"##cript_module":2155,"optimization_b":2156,"replica":2157,"channels":2158,"tanh":2159,"##runtime":2160,"f401":2161,"nativeargument":2162,"##ellowfin":2163,"##_numerics":2164,"testonnxruntime":2165,"testunaryufuncs":2166,"##opsetversion":2167,"test_reference_numerics":2168,"grad_coef":2169,"check_batched":2170,"32":2171,"64":2172,"_r":2173,"_conv":2174,"`:":2175,"cd":2176,"don":2177,"lin":2178,"line":2179,"rel":2180,"sq":2181,"sin":2182,"squ":2183,"user":2184,"##li":2185,"##liter":2186,"##_k":2187,"##_j":2188,"##_version":2189,"##_elem":2190,"##ound":2191,"##use":2192,"##een":2193,"##ever":2194,"##air":2195,"##pand":2196,"##rel":2197,"##ween":2198,"##fil":2199,"##ors":2200,"##erm":2201,"##ater":2202,"##enorm":2203,"##util":2204,"inter":2205,"##anch":2206,"##ases":2207,"##transpose":2208,"##loo":2209,"##unk":2210,"##view":2211,"##_select":2212,"trans":2213,"##_mu":2214,"##andnocusolver":2215,"##_no":2216,"arange":2217,"##_fold":2218,"##icode_":2219,"chunk":2220,"##ive_":2221,"##_lr":2222,"##_last":2223,"unicode_":2224,"##_input_padding":2225,"([\"":2226,"([[":2227,"added":2228,"targets":2229,"result_type":2230,"runnet":2231,"##_run":2232,"enc":2233,"cos":2234,"quants":2235,"conv_transpose":2236,"pretr":2237,"group_size":2238,"graphmodule":2239,"qconfig_map":2240,"instant":2241,"parent":2242,"expand":2243,"compression":2244,"distributeddataparallel":2245,"feedblob":2246,"##_buffers":2247,"weight_decay":2248,"##_var":2249,"common_dtype":2250,"skipcudaifnomagmaandnocusolver":2251,"drop_last":2252,"fout_path":2253,"ordereddict":2254,"##_scripted_module":2255,"##context":2256,"between":2257,"nllmodel":2258,"##_ctx":2259,"clean_ctx":2260,"b_hh":2261,"collections":2262,"##ways":2263,"##_source":2264,"_prepar":2265,"b_ih":2266,"unicode_liter":2267,"'{}":2268,":,":2269,"]}],":2270,"_all":2271,"ag":2272,"actu":2273,"cases":2274,"dc":2275,"dist_":2276,"fr":2277,"fol":2278,"full":2279,"gloo":2280,"handle":2281,"io":2282,"li":2283,"old":2284,"x_t":2285,"##lag":2286,"##dent":2287,"##_e":2288,"##_av":2289,"##_check":2290,"##mm":2291,"##mult":2292,"##af":2293,"##ake":2294,"##patch":2295,"##pattern":2296,"##iable":2297,"##ret":2298,"##bose":2299,"##vrt":2300,"##ating":2301,"##atype":2302,"##adam":2303,"##ingspec":2304,"##ree":2305,"()),":2306,"##_dir":2307,"op_info":2308,"##_sparse":2309,"##sert":2310,"##ign":2311,"device_option":2312,"##_inter":2313,"##istestcase":2314,"##_pool":2315,"constr":2316,"##ispatch":2317,"##_fx":2318,"##ically":2319,"show":2320,"##ather":2321,"test_n":2322,"child":2323,"##ateg":2324,"get_ddp_logging_data":2325,"get_forward":2326,"script_":2327,"##_helper":2328,"##_handles":2329,"batch_shape":2330,"typeerror":2331,"ens":2332,"=[\"":2333,"provi":2334,"##ance_matrix":2335,"##calar":2336,"()):":2337,"##_count":2338,"min_val":2339,"##ang_launch":2340,"{}\".":2341,"##dims":2342,"otherwise":2343,"datatype":2344,"directory":2345,"distributedtest":2346,"ref_m":2347,"_get_ddp_logging_data":2348,"gradcheck_wrapper":2349,"method_name":2350,"##common":2351,"##pool2d":2352,"##_clang_launch":2353,"traced":2354,"verbose":2355,"##worker":2356,"filters":2357,"##ect_":2358,"original":2359,"##minopsetversion":2360,"##e_index":2361,"desc":2362,"attribute":2363,"_internal":2364,"hip_clang_launch":2365,"hypothesistestcase":2366,"dependency_graph":2367,"##sert_observer_for":2368,"packagingerror":2369,"branch":2370,"myscript":2371,"pickle":2372,"##handled":2373,"##e_tril":2374,"is_pytorch_extension":2375,"operation":2376,"covariance_matrix":2377,"print_function":2378,"flatten_indices":2379,"##list_no":2380,"##mixin":2381,"property":2382,"skipifunsupportedminopsetversion":2383,"check_batched_gradgrad":2384,"instanti":2385,"unicode_literals":2386,"##_available":2387,"##vrtc":2388,")(":2389,".\"\"":2390,"//":2391,">=":2392,"[],":2393,"_w":2394,"_re":2395,"__m":2396,"dr":2397,"det":2398,"delta":2399,"metr":2400,"n_iter":2401,"post":2402,"wrap":2403,"x_":2404,"yield":2405,"}.":2406,"##match":2407,"##az":2408,"##awn":2409,"##io":2410,"##cre":2411,"##ng":2412,"##num":2413,"##yellowfin":2414,"int_":2415,"insert":2416,"##ask":2417,"thir":2418,"##stat":2419,"##e_if":2420,"##lose":2421,"##lock":2422,"##unex":2423,"##_different":2424,"##_spec":2425,"##_slicing":2426,"trace":2427,"transpos":2428,"##_match":2429,"##_index":2430,"##_pack":2431,"repr":2432,"replacement":2433,"recur":2434,"##_float":2435,"test_f":2436,"(\"[":2437,"getattr":2438,"output_blob":2439,"##iled":2440,"##ain__":2441,"##_help":2442,"##_warn":2443,"reset":2444,"##_rate":2445,"enum":2446,"'):":2447,"conv3d":2448,"_cuda":2449,"prob":2450,"neg":2451,"##own":2452,"##_module_map":2453,"quantizer":2454,"logging":2455,"##_output_of":2456,"control":2457,"use_":2458,"##ializer":2459,"part":2460,"scriptmodule":2461,"accep":2462,"##rectly":2463,"'),)),":2464,"seek":2465,"##ynam":2466,"##_parameters":2467,"##_tests":2468,"##builder":2469,"generate_":2470,"generated":2471,"register_quant_":2472,"libr":2473,"processes":2474,"multi":2475,"make_tensor":2476,"sym_help":2477,"backward_cell":2478,"event_":2479,"test_shape":2480,"msg":2481,"##orld_size":2482,"all_types_and_complex":2483,"##10d":2484,"##_link_args":2485,"##implementederror":2486,"symbolic_trace":2487,"##verride":2488,"serializationmixin":2489,"##ibration":2490,"##_controls":2491,"two":2492,"apply":2493,"maybe_unex":2494,"##lice":2495,"follow":2496,"##sert_observer_for_output_of":2497,"__main__":2498,"##azy":2499,"third":2500,"repres":2501,"accept":2502,"register_quant_pattern":2503,"backward_cell_net":2504,"maybe_unexpand":2505,")}":2506,"001":2507,"50":2508,"_l":2509,"_i":2510,"_as":2511,"_grad":2512,"bin":2513,"boo":2514,"cfloat":2515,"div":2516,"dill":2517,"et":2518,"equ":2519,"fb":2520,"find":2521,"gre":2522,"hard":2523,"hparam":2524,"k0":2525,"last_":2526,"launch":2527,"mo":2528,"mobile":2529,"pip":2530,"pow":2531,"rff":2532,"sw":2533,"some":2534,"windows":2535,"y_n":2536,"##lstm":2537,"##_it":2538,"##_add":2539,"##_utils":2540,"##og":2541,"##our":2542,"##user":2543,"##ped":2544,"##relu":2545,"##cess":2546,"##cast":2547,"##cpp":2548,"##nd":2549,"##batch":2550,"##fore":2551,"##flags":2552,"##24":2553,"##ese":2554,"##art_":2555,"##ed_":2556,"##ed_model":2557,"##ed_batch":2558,"##ed_params":2559,"thro":2560,"these":2561,"##roadc":2562,"##e_spec":2563,"##e_node":2564,"##tre":2565,"##local":2566,"##seq":2567,"##registry":2568,"is_st":2569,"##ipfile":2570,"##_mean":2571,"##_memory":2572,"clone":2573,"classes":2574,"reason":2575,"records":2576,"contr":2577,"##ish":2578,"##_code":2579,"logs":2580,"##_tol":2581,"int8":2582,"notimplementederror":2583,"##vert":2584,"##gradient":2585,"test_p":2586,"test_util":2587,"##_back":2588,"dims":2589,"(\"--":2590,"``.":2591,"grads":2592,"##_linalg":2593,"before":2594,"ort":2595,"check_error":2596,"check_slicing":2597,"union":2598,"pytest":2599,"enable":2600,"could":2601,"works":2602,"##configs":2603,"##_group":2604,"zero_":2605,"##value":2606,"functions":2607,"iterator":2608,"allreduce":2609,"logits":2610,"its":2611,"##_tensors":2612,"observer":2613,"bucket_sizes":2614,"{},":2615,"created":2616,"cannot":2617,"##use_fx":2618,"[[[":2619,"optimizertestbase":2620,"active_if":2621,"##e_for":2622,"ignore_index":2623,"package":2624,"packed_module":2625,"##_parameter":2626,"##_idx":2627,"##bucket":2628,"mat2":2629,"mat1":2630,"matrix":2631,"filecheck":2632,"})`":2633,"specify":2634,"_function":2635,"needed":2636,"##andalone":2637,"##_zipfile":2638,"avoid":2639,"aten_name":2640,"patterns":2641,"tracer":2642,"constantfill":2643,":]',":2644,"declarations":2645,"seq_len":2646,"include":2647,"attention_logits":2648,"dt2":2649,"dt1":2650,"except":2651,"maybe_in":2652,"hypothesis":2653,"##backend":2654,"loc_":2655,"##_bucket":2656,"view":2657,"##reads":2658,"predict_":2659,"max_buffered_batch":2660,"staticmethod":2661,"fill_":2662,"sort_key":2663,"however":2664,"topk":2665,"target_g_norm":2666,"##ancenorm":2667,"##_prod":2668,"preprocessor":2669,"sparse_dims":2670,"encoder":2671,"pretransform":2672,"again":2673,"actual":2674,"metric":2675,"posttransform":2676,"##ynamic":2677,"rff_output":2678,"##cpp_extension":2679,"is_standalone_module":2680,"check_slicing_tuple":2681,"max_buffered_batches":2682,",)),":2683,"19":2684,"5000":2685,"<=":2686,">)":2687,"_ac":2688,"_input":2689,"_placement":2690,"after":2691,"bre":2692,"both":2693,"cach":2694,"cell":2695,"del":2696,"fa":2697,"found":2698,"go":2699,"gather":2700,"h_n":2701,"helper":2702,"ji":2703,"k3":2704,"k1":2705,"lstm":2706,"next":2707,"ptr":2708,"row":2709,"txt":2710,"take":2711,"your":2712,"}^":2713,"##_1d":2714,"##oad":2715,"##uous":2716,"##pen":2717,"##pass":2718,"##p16":2719,"##:,":2720,"##so":2721,"##sist":2722,"##sible":2723,"##iary":2724,"##rc":2725,"##tetensor":2726,"##tools":2727,"##cpu":2728,"##wrap":2729,"##word":2730,"##50":2731,"##vd":2732,"##var":2733,"##jac":2734,"##atform":2735,"##utex":2736,"##etad":2737,"##ales":2738,"internal":2739,"than":2740,"torch_test_":2741,"them":2742,"##e_d":2743,"##e_im":2744,"##ctools":2745,"opspec":2746,"##iliary":2747,"input_blob":2748,"##iguous":2749,"##_meta":2750,"deviceoption":2751,"implic":2752,"return_indices":2753,"##apes":2754,"##_par":2755,"##_promotion":2756,"testcommon":2757,"replace":2758,"record":2759,"arch":2760,"##_cast":2761,"exec":2762,"low":2763,"##ify":2764,"##_flags":2765,"##ace_module_map":2766,"##_torch":2767,"##_bn":2768,"##_benchmark":2769,"(\"\"\"":2770,"##ayer":2771,"get_a":2772,"##conds":2773,"functools":2774,"being":2775,"typ":2776,"unhandled":2777,"\"\"\")":2778,"##_home":2779,"type_as":2780,"typevar":2781,"numer":2782,"(['":2783,"add_":2784,"addition":2785,"reshape":2786,"##_rel":2787,"##_reduce":2788,"=['":2789,"'))":2790,"conv1d":2791,"conv_3d":2792,"convolv":2793,"convtranspose":2794,"data_workers":2795,"##_optimizer":2796,"itertools":2797,"logdir":2798,"logdet":2799,"bytetensor":2800,"='{}":2801,"##acing":2802,"##_outputs":2803,"##_record":2804,"layer_name":2805,"dimensional":2806,"##_start_":2807,"1024":2808,"bucket_bytes":2809,"##_constant":2810,"max_val":2811,"##empty":2812,"##tensors":2813,"_single":2814,"statregistry":2815,"##clude":2816,"sample_inputs_linalg":2817,"##ables":2818,"sum_":2819,"]]}],":2820,"act_":2821,"warning":2822,"##modelhelper":2823,"depth":2824,"##_valid":2825,"##parameters":2826,"##encoder":2827,"err":2828,"##quantized":2829,":`(\\":2830,"serialized":2831,"depending":2832,"gcs":2833,"##medi":2834,"divisible":2835,"h_0":2836,"##e_size":2837,"_buffers":2838,"activation_post_process_index":2839,"##hardingspec":2840,"extra_link_args":2841,"starts":2842,"cross_prod":2843,"manu":2844,"precision_matrix":2845,"filtered":2846,"calibration":2847,"##_scale":2848,"##_scalar":2849,"##_qual":2850,"##optimizertype":2851,"##_per_channel":2852,"normal":2853,"via":2854,"##uxiliary":2855,"##_threads":2856,"reader":2857,"grad_tensor2":2858,"_jit_pass":2859,"attention_weights":2860,"_trace_module_map":2861,"##_subgraph":2862,"compute":2863,"signal":2864,"updated":2865,"##_always":2866,"current_env":2867,"cdouble":2868,"linux":2869,"since":2870,"runnetonce":2871,"frac":2872,"like":2873,"ensure":2874,"provided":2875,".\"\"\"":2876,"recurr":2877,"_cudabase":2878,"control_input":2879,"all_types_and_complex_and":2880,"following":2881,"_as_parameter":2882,"binary":2883,"mobileoptimizertype":2884,"##_iters":2885,"maybe_insert_observer_for_output_of":2886,"##etadata":2887,"torch_test_cpp_extension":2888,"implicit":2889,"get_auxiliary":2890,"conv_3d_configs":2891,"convolving":2892,"logdetjac":2893,"activation_post_process_indexes":2894,"_as_parameter_":2895,"get_auxiliary_parameters":2896,"(-":2897,"({}":2898,".],":2899,"05":2900,"30":2901,"_m":2902,"_a":2903,"_valid":2904,"c3":2905,"cod":2906,"categ":2907,"dot":2908,"f_dtypes":2909,"fail":2910,"handler":2911,"h_min":2912,"handles":2913,"me":2914,"pos":2915,"promot":2916,"promotion":2917,"qint8":2918,"qconv":2919,"rate":2920,"rref":2921,"su":2922,"sim":2923,"sgd":2924,"simple":2925,"samples":2926,"saf":2927,"tags":2928,"was":2929,"way":2930,"world_size":2931,"yet":2932,"##line":2933,"##dep":2934,"##_one":2935,"##_yellowfin":2936,"##most_":2937,"##metadata":2938,"##override":2939,"##ue_":2940,"##eat":2941,"##pt_":2942,"##pag":2943,"##ri":2944,"##cul":2945,"##copy":2946,"##close":2947,"##gh":2948,"##gress":2949,"##nvrtc":2950,"##ore_":2951,"##onent":2952,"##init":2953,"##etemp":2954,"##almost_":2955,"dedent":2956,"##leans":2957,"defin":2958,"##storage":2959,"##e_types":2960,"##itian":2961,"##reason":2962,"##entrop":2963,"##ilit":2964,"tensor_meta":2965,"standalone":2966,"##apt":2967,"##export":2968,"##_pl":2969,"##ationcontext":2970,"##uples":2971,"tool":2972,"##_cap":2973,"##_com":2974,"exit":2975,"export":2976,"##_fork":2977,"##_flag":2978,"short":2979,"shapes":2980,"string":2981,"test_tensor":2982,"test_serialization":2983,"dim_out":2984,"##ested":2985,"model0":2986,"get_default_dtype":2987,":`~":2988,"scatter":2989,"defaults":2990,"types":2991,"##spadd":2992,"check_n":2993,"check_name":2994,"check_trace":2995,"##ained":2996,"\"):":2997,"adapt":2998,"nnz":2999,"batchnorm":3000,"##_input_workers":3001,"##oub":3002,"maked":3003,"_co":3004,"propag":3005,"kernel32":3006,"options":3007,"##_optim":3008,"##coales":3009,"##_load":3010,"##parser":3011,"shardmetadata":3012,"formals":3013,"bytes":3014,"##_records":3015,"reduction":3016,"no_args":3017,"##queues":3018,"##ctive":3019,"_scalar":3020,"statist":3021,"weak":3022,"exponent":3023,"acc":3024,"operator_benchmark":3025,"subgraph":3026,"##datapipe":3027,"example_inputs":3028,"matmul":3029,"mask_select":3030,")`.":3031,"_for":3032,"default_generator":3033,"##test_args":3034,"matches":3035,"error_context":3036,"##pool3d":3037,"init_ops":3038,"init_data":3039,"prepare_":3040,"template":3041,"##llloss":3042,"master_grad":3043,"master_device_opt":3044,"##compare_":3045,"vert":3046,"##_exp":3047,"##workspace":3048,"##benchmarkbase":3049,"##olute_im":3050,"precisionoverride":3051,"##_zero_point":3052,"event":3053,"calcul":3054,"deser":3055,"dtypesifcpu":3056,"assert_almost_":3057,"attributes":3058,"debug_records":3059,"['[:,":3060,"get_all":3061,"remote":3062,"##_enable":3063,"##_from_mod":3064,"##_stats":3065,"avg_pool":3066,"[:,":3067,"implementation":3068,"##****************":3069,"_shard_lengths":3070,"_shard_offsets":3071,"'''":3072,"stderr_handle":3073,"learning":3074,"learnable":3075,"extensions":3076,"256":3077,"absolute_im":3078,"small":3079,"url":3080,"##_short":3081,"exists":3082,"model_name_0":3083,"stdout_handle":3084,"floating_and_complex_types_and":3085,"##_key_fn":3086,"optimization_block":3087,"sqrt":3088,"##ermitian":3089,"cosin":3090,"##_source_name":3091,"_prepare_fx":3092,"'{}'":3093,"packagingerrorreason":3094,"myscriptmodule":3095,"##list_no_prepack":3096,"instantiationcontext":3097,"##_packed_params":3098,"resetworkspace":3099,"negative":3100,"generate_pt_":3101,"library":3102,"##roadcast":3103,"##local_rank":3104,"int8_dtypes":3105,"##mediates":3106,"_mask":3107,"_validate_":3108,"codetemp":3109,"##entropy":3110,"makedirs":3111,"bytesio":3112,"mask_selected":3113,"init_data_input_workers":3114,"assert_almost_equal":3115,"debug_records_from_mod":3116,"absolute_import":3117,"generate_pt_test":3118,"codetemplate":3119,"\"'":3120,"\"--":3121,"${":3122,"'/":3123,"(<":3124,"15":3125,"__new":3126,"_modules":3127,"bmm":3128,"c_":3129,"c1":3130,"dn":3131,"dur":3132,"dump":3133,"fix":3134,"fuse_fx":3135,"h_max":3136,"mem":3137,"meta":3138,"ndim":3139,"ow":3140,"po":3141,"qsize":3142,"right":3143,"rng":3144,"s2":3145,"suc":3146,"tu":3147,"tuples":3148,"w3":3149,"}),":3150,"##lap":3151,"##lib":3152,"##dist_":3153,"##_ow":3154,"##_2d":3155,"##_empty":3156,"##man":3157,"##eps":3158,"##aco":3159,"##ause":3160,"##sw":3161,"##son":3162,"##code":3163,"##catter":3164,"##c10d":3165,"##cause":3166,"##ger":3167,"##gput":3168,"##qat":3169,"##false":3170,"##fect_":3171,"##ycl":3172,"##ored":3173,"##ele":3174,"##etcd":3175,"##are":3176,"invalid":3177,"deb":3178,"##led":3179,"##left":3180,"##edd":3181,"##edim":3182,"there":3183,"##t_configs":3184,"torchbenchmarkbase":3185,"##amp":3186,"##stom":3187,"##ime":3188,"##lopen":3189,"##item":3190,"##unter":3191,"##_dist_":3192,"##_dispatch":3193,"##_sum":3194,"##_script_module":3195,"##ilt":3196,"##ilter":3197,"##igraph":3198,"##_math":3199,"##_mobile":3200,"##_mutex":3201,"##andcast":3202,"device_opt":3203,"tensor2":3204,"##_nodes":3205,"standalone_":3206,"standalone_module":3207,"steps":3208,"##ext_":3209,"testtop":3210,"off":3211,"##ismatch":3212,"##_cop":3213,"##_call":3214,"##_clean":3215,"##omial":3216,"assertre":3217,"##iff":3218,"##ication":3219,"##ither":3220,"test_str":3221,"assertin":3222,"assertfalse":3223,"dim_in":3224,"```":3225,"floattensor":3226,"model_helper":3227,"onedim":3228,"##consist":3229,"##ively":3230,"##_lib":3231,"because":3232,"param_cpu":3233,"param_bucket":3234,"alias":3235,"also":3236,"##_hermitian":3237,"while":3238,"type_start_":3239,"quint8":3240,"##_world":3241,"target_mu":3242,"target_lr":3243,"target_dist_":3244,"resize_":3245,"ends":3246,"coordinator":3247,"##ialize":3248,"(()),":3249,"pres":3250,"setup":3251,"set_warn":3252,"##affe2":3253,"scale_tril":3254,"arg_name":3255,"distance":3256,"caffe_":3257,"layers":3258,"optimize_for":3259,"##anged":3260,"##_state":3261,"uses":3262,"call_module":3263,"call_method":3264,"call_function":3265,"']))":3266,"platform":3267,"{}'.":3268,"instancenorm":3269,"directly":3270,"comm_world":3271,"##fact":3272,"##_train":3273,"compile":3274,"]]],":3275,"random_":3276,"initializer":3277,"integer":3278,"results":3279,"##e_filter":3280,"warns":3281,"##_value":3282,"cur_subgraph":3283,"##_blobs":3284,"##device":3285,"##_contiguous":3286,"copygput":3287,"hasattr":3288,"('[-":3289,"values_ref":3290,"##ke_quant":3291,"##ields":3292,"100000":3293,"##_to_clean":3294,"]['":3295,"##namescope":3296,"curr_buffer":3297,"indices_ref":3298,"build_directory":3299,"weight_blob":3300,"version_info":3301,"tracing":3302,"##_file_handles":3303,"count":3304,"common_utils":3305,"\"])":3306,"multiple":3307,"##_python":3308,"##ferencechecks":3309,"include_filter":3310,"##_zero_dim":3311,"dropout":3312,"differentiable":3313,"benchmark_run":3314,"##cumulate":3315,"node_rank":3316,"step_rate":3317,"repo_name":3318,"repo_ow":3319,"##options":3320,"_module_cop":3321,"##_seconds":3322,"custom":3323,"cmd_flag":3324,"predi":3325,"##ocpu":3326,"stream_buffer":3327,"max_buffer_size":3328,"cnnmodelhelper":3329,"##data_fn":3330,"##uct_configs":3331,"##classes":3332,"attention_weighted_":3333,"urlopen":3334,"##...":3335,"existing":3336,"model_name_1":3337,"currently":3338,"floating_and_complex_types":3339,"target_h_min":3340,"target_h_max":3341,"environment":3342,"accumulate":3343,"subprocess_file_handles":3344,"remove":3345,"_convolution":3346,"linearity":3347,"##_fold_scripted_module":3348,"_all_buffers":3349,"construct":3350,"test_nllloss":3351,"_weight":3352,"int_tensor":3353,"inserted":3354,"##stats":3355,"use_env":3356,"event_dim":3357,"_grad_input_padding":3358,"dill_function":3359,"etcd":3360,"##_backward":3361,"grads_group":3362,"_accumulate":3363,"additional":3364,"startswith":3365,"cross_product_configs":3366,"_jit_pass_in":3367,"maybe_insert_observer_for_output_of_model":3368,"##ilities":3369,"##oubl":3370,"get_all_math":3371,"__new__":3372,"owner":3373,"success":3374,"##swish":3375,"##fect_model":3376,"##andcastle":3377,"stepsize":3378,"testtopk":3379,"assertreferencechecks":3380,"param_buckets":3381,"target_dist_avg":3382,"set_warn_always":3383,"optimize_for_mobile":3384,"copygputocpu":3385,"curr_buffer_size":3386,"benchmark_runner":3387,"repo_owner":3388,"_module_copies":3389,"attention_weighted_encoder":3390,"get_all_math_dtypes":3391,"'--":3392,".),":3393,"/'":3394,"14":3395,"1000":3396,":-":3397,"=-":3398,"={}":3399,">`.":3400,"__":3401,"__d":3402,"_us":3403,"_log":3404,"bess":3405,"bind":3406,"c4":3407,"cycl":3408,"d_":3409,"either":3410,"f_":3411,"f_b":3412,"f_a":3413,"f_new":3414,"f_old":3415,"fp16":3416,"gr":3417,"g_norm":3418,"here":3419,"home":3420,"iw":3421,"ih":3422,"ls":3423,"l_n":3424,"mic":3425,"nv":3426,"next_":3427,"ppr":3428,"qat":3429,"sem":3430,"sure":3431,"sandcastle":3432,"tens":3433,"v3":3434,"wl":3435,"wa":3436,"x1":3437,"##len":3438,"##lack":3439,"##dest":3440,"##_or":3441,"##_le":3442,"##_all":3443,"##_us":3444,"##ok":3445,"##ugh":3446,"##ev":3447,"##action":3448,"##sh":3449,"##sing":3450,"##spect":3451,"##squeeze":3452,"##sign":3453,"##slice":3454,"##s_memory":3455,"##iability":3456,"##ren":3457,"##rid":3458,"##rib":3459,"##rpath":3460,"##ts":3461,"##cer":3462,"##cated":3463,